// ignore_for_file: public_member_api_docs, sort_constructors_first
import 'dart:io';

import 'package:carousel_slider/carousel_controller.dart';
import 'package:carousel_slider/carousel_slider.dart';
import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:dwaweenx/Data/Models/card_data_model.dart';
import 'package:dwaweenx/Data/Models/dewan_body_model.dart';
import 'package:dwaweenx/Domain/Entities/audio.dart';
import 'package:dwaweenx/Domain/Entities/card_data.dart';
import 'package:dwaweenx/Domain/Entities/dewan.dart';
import 'package:dwaweenx/Domain/Entities/dewanBody.dart';
import 'package:dwaweenx/Domain/Entities/groupByPurpose.dart';
import 'package:dwaweenx/Domain/Entities/kasedaBody.dart';
import 'package:dwaweenx/Domain/Entities/note.dart';
import 'package:dwaweenx/core/help/database_helper_fav.dart';
import 'package:dwaweenx/core/help/database_helper_notes.dart';
import 'package:dwaweenx/core/utils.dart';
import 'package:dwaweenx/features/About/about.dart';
import 'package:dwaweenx/features/Dwaween/dawaween_screen.dart';
import 'package:dwaweenx/features/Home/home_screen.dart';
import 'package:dwaweenx/features/KasydaDetails/kasydaShareScreen.dart';
import 'package:dwaweenx/services/cloud_firestore_service.dart';
import 'package:easy_localization/easy_localization.dart';
import 'package:firebase_storage/firebase_storage.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:just_audio/just_audio.dart';
import 'package:path_provider/path_provider.dart';
import 'package:screenshot/screenshot.dart';
import 'package:share_plus/share_plus.dart';

import 'Kasaed/kasaed.dart';

class BaseProvider extends ChangeNotifier {
  DawawenBody uploadData = DawawenBody(
    dawawen: [
      Dawawen(
        id: 'D1',
        name: 'العروة الوثقى في الاستغاثة بسيد الورى',
        nameT: 'العروة الوثقى في الاستغاثة بسيد الورى',
        dec:
            'أحد الدواوين الستة المشهورة للشيخ في المديح النبوي المخصصة لمدح سيد البشر رسول الله ﷺ',
        type: 'Dewan',
        kasaed: [
          KasydaBody(
            id: 'K1',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio1.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'كفيت صحابي في الطريق غناء',
            nameT: 'كَفَيْتُ صِحَابِي فِي الطَّرِيقِ عَنَاءَ',
            kaseyda:
                'كفيت صحابي في الطريق عناء. فكلهم بالجذب نال مناء. ولم يك للأقطاب قبلي مثل ما. لذا العبد من فيض يروق سناء. وأشكر ربي ليس سري عاقرا. فأصغر أتباعي أنيل فناء. وذلك من حب الرسول وسره. بسردي له الأمداح حزت لواء. فإكسير هذا العبد حب محمد. وكنزي أن أثنى عليه ثناء. وذلك جيشي وهو درعي ومغفري. وإن مسني داء أجده دواء. وذا طاعتي دهري وصومي وحجتي. وفيه صلاتي منه نلت غناء. وذلك حرثي وهو بيعي وثروتي. وأكلي وشربي منه نلت رواء. فلم أرج مخلوقا سوى البدر سيدي. محمد الماحي المنيل ولاء. وقد شد فقري واغترابي وفاقتي. ولم أطمعن من غير طه عطاء. عليه صلاة الله ثم سلامه. صلاة بها أجني جنى وجداء. عليه صلاة الله ثم سلامه. صلاة بها يعطي الأمين حباء. عليه صلاة الله ثم سلامه. صلاة بها لم ألق بعد عناء. عليه صلاة الله ثم سلامه. صلاة ينال القلب منها جلاء. عليه صلاة الله ثم سلامه. لسقمي وأمراضي تكون شفاء. عليه صلاة الله ثم سلامه. صلاة على الهادي تكون جزاء. عليه صلاة الله ثم سلامه. صلاة بها روحي ينال غذاء. عليه صلاة الله ثم سلامه. وآل وصحب مصطفين صفاء.',
            kaseydaT:
                'كَفَيْتُ صِحَابِي فِي الطَّرِيقِ عَنَاءَ. فَكُلُّهُمُ بِالْجَذْبِ نَالَ مُنَاءَ. وَلَمْ يَكُ لِلْأَقْطَابِ قَبْلِيَ مِثْلَ مَا لِذَا الْعَبْدِ مِنْ فَيْضٍ يَرُوقُ سَنَاءَ. وَأَشْكُرُ رَبِّي لَيْسَ سِرِّيَ عَاقِرًا. فَأَصْغَرُ أَتْبَاعِي أُنِيلَ فَنَاءَ. وَذَلِكَ مِنْ حُبِّ الرَّسُولِ وَسِرِّهِ. بِسَرْدِي لَهُ الْأَمْدَاحَ حُزْتُ لِوَاءَ. فَإكْسِيرُ هَذَا الْعَبْدِ حُبُّ مُحَمَّدٍ. وَكَنْزِيَ أَنْ أُثْنِى عَلَيْهِ ثَنَاءَ. وَذَلِكَ جَيْشِي وَهْوَ دِرْعِي وَمِغْفَرِي. وَإنْ مَسَّنِي دَاءٌ أَجِدْهُ دَوَاءَ. وَذَا طَاعَتِي دَهْرِي وَصَوْمِي وَحَجَّتِي. وَفِيهِ صَلَاتِي مِنْهُ نِلْتُ غِنَاءَ. وَذَلِكَ حَرْثِي وَهْوَ بَيْعِي وَثَرْوَتِي. وَأَكْلِي وَشُرْبِي مِنْهُ نِلْتُ رِوَاءَ. فَلَمْ أَرْجُ مَخْلُوقًا سِوَى الْبَدْرِ سَيِّدِي. مُحَمَّدٍ الْمَاحِي الْمُنِيلِ وَلَاءَ. وَقَدْ شَدَّ فَقْرِي وَاغْتِرَابِي وَفَاقَتِي. وَلَمْ أَطْمَعَنْ مِنْ غَيْرِ طَهَ عَطَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. صَلَاةً بِهَا أَجْنِي جَنًى وَجَدَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. صَلَاةً بِهَا يُعْطِي الْأَمِينُ حِبَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. صَلَاةً بِهَا لَمْ أَلْقَ بَعْدُ عَنَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. صَلَاةً يَنَالُ الْقَلْبُ مِنْهَا جَلَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. لِسُقْمِي وَأَمْرَاضِي تَكُونُ شِفَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. صَلَاةً عَلَى الْهَادِي تَكُونُ جَزَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. صَلَاةً بِهَا رُوحِي يَنَالُ غِذَاءَ. عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ. وَآلٍ وَصَحْبٍ مُصْطَفَيْنَ صَفَاءَ.',
            letter: 'ء',
          ),
          KasydaBody(
            id: 'K2',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio2.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'دعوت رسول الله مذ عمنا الكرب. وسيان في هذاكم الشرق والغرب.',
            nameT: 'دعوت رسول الله مذ عمنا الكرب. وسيان في هذاكم الشرق والغرب.',
            kaseyda:
                'دعوت رسول الله مذ عمنا الكرب. وسيان في هذاكم الشرق والغرب. ولم يك عند الخلق حام سواؤه. ولم ينفعن بعد ولم ينفعن قرب. فلم أر حصنا مانعا يقصدونه. سوى ظل خير الخلق إذ جاءنا الرعب. فزحزح عنا كل كرب أنالنا. منالا به قد قر عيني والقلب. وشاد لنا مجدا تقاعس دونه. أكاسر فرس والقياصرة النجب. ولا غرو أن المصطفى القرم جوده. به سعد الكونان والعجم والعرب. ولا غرو أن المصطفى القرم جوده. به نزل الفرقان والعلم والخصب. به آدم قد تاب من بعد وحشة. ونال مقاما دونه انحطت الشهب. ويشكر إذ ناداه والبحر زاخر. أتاه سلام بان عن أهله الريب. كذلك إبراهيم قد نال خلة. وموسى كلاما دونه العقل واللب. كذلك روح الله عيسى وإنه. ترفع للمولى وإن جاءنا نربو. فيا رب هب لي بالأمين وراثة. لهم كلهم بالمصطفى قضي النحب. وتورثني يا رب منك خلافة. وعلما وجودا دون أنمله السحب. وتجعل مصري هذه مطمئنة. تسوس بلاد الله لم ينحها كرب. وتقضي إلهي ما أتاك مطالبا. من العبد إبراهيم ولياته الجلب. وترزقه التكوين يا خير سيد. ويذهب عني الهم والشك والعيب. صلاة وتسليم على النور سرمدا. كذا الآل والأولاد والأهل والصحب.',
            kaseydaT:
                'دعوت رسول الله مذ عمنا الكرب. وسيان في هذاكم الشرق والغرب. وَلَمْ يَكُ عِنْدَ الْخَلْقِ حامٍ سِوَاؤُهُ. وَلَمْ يَنْفَعَنْ بُعْدٌ وَلَمْ يَنْفَعَنْ قُرْبُ. فَلَمْ أَرَ حِصْنًا مَانِعًا يَقْصِدُونَهُ. سِوَى ظِلِّ خَيْرِ الْخَلْقِ إذْ جَاءَنَا الرُّعْبُ. فَزَحْزَحَ عَنَّا كُلَّ كَرْبٍ أَنَالَنَا. مَنَالًا بِهِ قَدْ قَرَّ عَيْنِيَ وَالْقَلْبُ. وَشَادَ لَنَا مَجْدًا تَقَاعَسَ دُونَهُ. أَكَاسِرُ فُرْسٍ وَالْقَيَاصِرَةُ النُّجْبُ. وَلَا غَرْوَ أَنَّ الْمُصْطَفَى الْقَرْمَ جُودُهُ. بِهِ سَعِدَ الْكَوْنَانِ وَالْعُجْمُ وَالْعُرْبُ. وَلَا غَرْوَ أَنَّ الْمُصْطَفَى الْقَرْمَ جُودُهُ. بِهِ نَزَلَ الْفُرْقَانُ وَالْعِلْمُ وَالْخِصْبُ. بِهِ آدَمٌ قَدْ تَابَ مِنْ بَعْدِ وَحْشَةٍ. وَنَالَ مَقَامًا دُونَهُ انْحَطَّتِ الشُّهْبُ. وَيَشْكُرُ إذْ نَادَاهُ وَالْبَحْرُ زَاخِرٌ. أَتَاهُ سَلَامٌ بَانَ عَنْ أَهْلِهِ الرَّيْبُ. كَذَلِكَ إبْرَاهِيمُ قَدْ نَالَ خُلَّةً. وَمُوسَى كَلَامًا دُونَهُ الْعَقْلُ وَاللُّبُّ. كَذَلِكَ رُوحُ اللهِ عِيسَى وَإنَّهُ. تَرَفَّعَ لِلْمَوْلَى وَإنْ جَاءَنَا نَرْبُو. فَيَا رَبِّ هَبْ لِي بِالْأَمِينِ وِرَاثَةً. لَهُمْ كُلِّهِمْ بِالْمُصْطَفَى قُضِيَ النَّحْبُ. وَتُورِثُنِي يَا رَبِّ مِنْكَ خِلَافَةً. وَعِلْمًا وَجُودًا دُونَ أَنْمُلِهِ السُّحْبُ. وَتَجْعَلُ مِصْرِي هَذِهِ مُطْمَئِنَّةً. تَسُوسُ بِلَادَ اللهِ لَمْ يَنْحُهَا كَرْبُ. وَتَقْضِي إلَهِي مَا أَتَاكَ مُطالِبًا. مِنَ الْعَبْدِ إبْرَاهِيمَ وَلْيَاتِهِ الْجَلْبُ. وَتَرْزُقُهُ التَّكْوِينَ يَا خَيْرَ سَيِّدٍ. وَيَذْهَبُ عَنِّي الْهَمُّ وَالشَّكُّ وَالْعَيْبُ. صَلَاةٌ وَتَسْلِيمٌ عَلَى النُّورِ سَرْمَدًا. كَذَا الْآلُ وَالْأَوْلادُ وَالْأَهْلُ وَالصَّحْبُ.',
            letter: 'ب',
          ),
          KasydaBody(
            id: 'K3',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio3.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'لئن أحزن الأقوام هم وأسنتوا',
            nameT: 'لَئِنْ أَحْزَنَ الْأَقْوَامَ هَمٌّ وَأَسْنَتُوا',
            kaseyda:
                'لئن أحزن الأقوام هم وأسنتوا . فشمل همومي بالأمين مشتت لقد جاء خير الخلق والجدب شامل . فأخصبت الدنيا فعاشوا وقوتوا فقاد البرايا للهداية ناصحا . وقد سمعوا القرآن يتلى وأنصتوا فعم هدى الهادي البسيطة كلها . وسل سيوف النصر صحب وأصلتوا فأشرق نور الدين في كل موطن . وصد عن الأوثان فرض موقت إليك رسول الله أشكو فإن تي . قرون محوا أنوار دين وأشمتوا عليك صلاة الله ثم سلامه . صلاة بها كل الورى لك أخبتوا عليه صلاة الله ثم سلامه . نكون بعيش حيثما القوم أسنتوا عليه صلاة الله ثم سلامه . صلاة بها أبقى لربي أقنت عليه صلاة الله ثم سلامه . وملك لغير المسلمين مفتت عليك صلاة الله ثم سلامه . وآل وصحب للأباطل شتتوا',
            kaseydaT:
                'لَئِنْ أَحْزَنَ الْأَقْوَامَ هَمٌّ وَأَسْنَتُوا . فَشَمْلُ هُمُومِي بِالْأَمِينِ مُشَتَّتُ لَقَدْ جَاءَ خَيْرُ الْخَلْقِ وَالْجَدْبُ شَامِلٌ . فَأَخْصَبَتِ الدُّنْيَا فَعَاشُوا وَقَوَّتُوا فَقَادَ الْبَرَايَا لِلْهِدَايَةِ نَاصِحًا . وَقَدْ سَمِعُوا الْقُرْآنَ يُتْلَى وَأَنْصَتُوا فَعَمَّ هُدَى الْهَادِي الْبَسِيطَةَ كُلَّهَا . وَسَلَّ سُيُوفَ النَّصْرِ صَحْبٌ وَأَصْلَتُوا فَأَشْرَقَ نُورُ الدِّينِ فِي كُلِّ مَوْطِنٍ . وَصَدَّ عَنِ الْأَوْثَانِ فَرْضٌ مُوَقَّتُ إلَيْكَ رَسُولَ اللهِ أَشْكُو فَإنَّ تِي . قُرُونٌ مَحَوْا أَنْوَارَ دِينٍ وَأَشْمَتُوا عَلَيْكَ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا كُلُّ الْوَرَى لَكَ أَخْبَتُوا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . نَكُونُ بِعَيْشٍ حَيْثُمَا الْقَوْمُ أَسْنَتُوا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أَبْقَى لِرَبِّيَ أَقْنُتُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَمُلْكٌ لِغَيْرِ الْمُسْلِمِينَ مُفَتَّتُ عَلَيْكَ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ لِلْأَبَاطِلِ شَتَّتُوا',
            letter: 'ت',
          ),
          KasydaBody(
            id: 'K4',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio4.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'شهدت ولا ألفى بعهدي أنكث',
            nameT: 'شَهِدْتُ وَلَا أُلْفَى بِعَهْدِيَ أَنْكُثُ',
            kaseyda:
                'شهدت ولا ألفى بعهدي أنكث . بأني على حبي لأحمد أمكث أحبك حبا لا يكيف أمره . وكل الذي يهواك أو من يحدث فليتي ألقى المصطفى القرم ليته . على عوجي دهري بروعي ينفث بحب رسول الله سادت عشيرتي . ونسلي ومن يرعى ذمامي ويمكث بحب رسول الله تعلو مدينتي . على المدن والأمصار والخير يحدث بحب رسول الله تعلو منارتي . منارات ملك عهدك الدهر ينكث عليه صلاة الله ثم سلامه . صلاة تضيء القبر ساعة أجدث عليه صلاة الله ثم سلامه . وآل وصحب بالحديث تحدثوا',
            kaseydaT:
                'شَهِدْتُ وَلَا أُلْفَى بِعَهْدِيَ أَنْكُثُ . بِأَنِّي عَلَى حُبِّي لِأَحْمَدَ أَمْكُثُ أُحِبُّكَ حُبًّا لَا يُكَيَّفُ أَمْرُهُ . وَكُلَّ الذِي يَهْوَاكَ أَوْ مَنْ يُحَدِّثُ فَلَيْتِيَ أَلْقَى الْمُصْطَفَى الْقَرْمِ لَيْتَهُ . عَلَى عِوَجِي دَهْرِي بِرُوعِيَ يَنْفُثُ بِحُبِّ رَسُولِ اللهِ سَادَتْ عَشِيرَتِي . وَنَسْلِي وَمَنْ يَرْعَى ذِمَامِي وَيَمْكُثُ بِحُبِّ رَسُولِ اللهِ تَعْلُو مَدِينَتِي . عَلَى الْمُدْنِ وَالْأَمْصَارِ وَالْخَيْرُ يَحْدُثُ بِحُبِّ رَسُولِ اللهِ تَعْلُو مَنَارَتِي . مَنَارَاتِ مُلْكٍ عَهْدَكَ الدَّهْرَ يَنْكُثُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً تُضِيءُ الْقَبْرَ سَاعَةَ أُجْدَثُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ بِالْحَدِيثِ تَحَدَّثُوا',
            letter: 'ث',
          ),
          KasydaBody(
            id: 'K5',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio5.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'ظعنت إلى وادي الحبيب المبهج',
            nameT: 'ظَعَنْتُ إلَى وَادِي الْحَبِيبِ الْمُبَهَّجِ',
            kaseyda:
                'ظعنت إلى وادي الحبيب المبهج . محمد الماحي الضلال المسرج بكاظمة1 أحباب قلبي وسلعها . ووادي النقا مغني الكريم المتوج فهل لي من المام بتلك وليتني . أوافيك يا من نهجه الدهر منهجي أوافي الذي لولاه ما ذر شارق . ولولاه نور الشمس لم يتبلج نبي حوى ما لم ينله مقرب . ولا في بيوت الحي بالمتولج عليه صلاة الله ثم سلامه . أعيش بها دهري بغير مزعج عليه صلاة الله ثم سلامه . فإني أسير الحب دون تغنج عليه صلاة الله ثم سلامه . صلاة على طول المدى لم تنسج عليه صلاة الله ثم سلامه . على ذلك الفخم المهيب المبهج عليه صلاة الله ثم سلامه . على ذلك الأقنى الأزج والابلج عليه مع الآل الكرام وصحبه . ومن سلكوا في الدين أحسن منهج',
            kaseydaT:
                'ظَعَنْتُ إلَى وَادِي الْحَبِيبِ الْمُبَهَّجِ . مُحَمَّدٍ الْمَاحِي الضَّلَالَ الْمُسَرَّجِ بِكَاظِمَةٍ1 أَحْبَابُ قَلْبِي وَسَلْعِهَا . وَوَادِي النَّقَا مُغْنِي الْكَرِيمِ الْمُتَوَّجِ فَهَلْ لِي مِنِ الْمَامٍ بِتِلْكَ وَلَيْتَنِي . أُوَافِيكَ يَا مَنْ نَهْجُهُ الدَّهْرَ مَنْهَجِي أُوَافِي الذِي لَوْلَاهُ مَا ذَرَّ شَارِقٌ . وَلَوْلَاهُ نُورُ الشَّمْسِ لَمْ يَتَبَلَّجِ نَبِيٌّ حَوَى مَا لَمْ يَنَلْهُ مُقَرَّبٌ . وَلَا فِي بُيُوتِ الْحَيِّ بِالْمُتَوَلِّجِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . أَعِيشُ بِهَا دَهْرِي بِغَيْرِ مُزَعِّجِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . فَإنِّي أَسِيرُ الْحُبِّ دُونَ تَغَنُّجِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً عَلَى طُولِ الْمَدَى لَمْ تُنَسَّجِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . عَلَى ذَلِكَ الْفَخْمِ الْمَهِيبِ الْمُبَهَّجِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . عَلَى ذَلِكَ الْأَقْنَى الْأَزَجِّ وَالاَبْلَجِ عَلَيْهِ مَعَ الآلِ الْكِرَامِ وَصَحْبِهِ . وَمَنْ سَلَكُوا فِي الدِّينِ أَحْسَنَ مَنْهَجِ',
            letter: 'ج',
          ),
          KasydaBody(
            id: 'K6',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio6.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'على المصطفى المختار نور الأباطح',
            nameT: 'عَلَى الْمُصْطَفَى الْمُخْتَارِ نُورِ الْأَبَاطِحِ',
            kaseyda:
                'على المصطفى المختار نور الأباطح . صلاة بها تمحى جميع قبائحي درأت فسادي بالمدائح جالبا . صلاحي بذكر المصطفى والمدائح وقد شاب فودي في المجون ولم أزل . أسير الهوى ما شمت برق المرابح2 ولم أر شيئا غير دعوى محبة الـــــ . ـأمين ولو لم ترسخن في جوانحي ومدحي له مزجى البضاعة قاصرا . عن الشأو هل يرضى المقفى مدائحي فما ثم مرجو سوى فضل خالقي . لذا العبد إبراهيم عين القبائح صلاة على المختار من آل هاشم . محمد الهادي منير الأباطح عليه صلاة الله ثم سلامه . يكون الذي يسعى لضيري كناطح3 عليه صلاة الله ثم سلامه . وتزجي لهذا العبد كل المنائح عليه صلاة الله ثم سلامه . فتبعد عني الشؤم من كل بارح عليه صلاة الله ثم سلامه . وآل وصحب كل غاد ورائح',
            kaseydaT:
                'عَلَى الْمُصْطَفَى الْمُخْتَارِ نُورِ الْأَبَاطِحِ . صَلَاةً بِهَا تُمْحَى جَمِيعُ قَبَائِحِي دَرَأْتُ فَسَادِي بِالْمَدَائِحِ جَالِبًا . صَلَاحِي بِذِكْرِ الْمُصْطَفَى وَالْمَدَائِحِ وَقَدْ شَابَ فَوْدِي فِي الْمُجُونِ وَلَمْ أَزَلْ . أَسِيرَ الْهَوَى مَا شِمْتُ بَرْقَ الْمَرَابِحِ2 وَلَمْ أَرَ شَيْئًا غَيْرَ دَعْوَى مَحَبَّةِ الْـــــ . ـأَمِينِ وَلَوْ لَمْ تَرَسَخَنْ فِي جَوَانِحِي وَمَدْحِي لَهُ مُزْجَى الْبِضَاعَةِ قَاصِرًا . عَنِ الشَّأْوِ هَلْ يَرْضَى الْمُقَفَّى مَدَائِحِي فَمَا ثَمَّ مَرْجُوٌّ سِوَى فَضْلِ خَالِقِي . لِذَا الْعَبْدِ إبْرَاهِيمَ عِيْنِ الْقَبَائِحِ صَلَاةٌ عَلَى الْمُخْتَارِ مِنْ آلِ هَاشِمٍ . مُحَمَّدٍ الْهَادِي مُنِيرِ الْأَبَاطِحِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . يَكُونُ الذِي يَسْعَى لِضَيْرِي كَنَاطِحِ3 عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَتُزْجِي لِهَذَا الْعَبْدِ كُلَّ الْمَنَائِحِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . فَتُبْعِدُ عَنِّي الشُّؤْمَ مِنْ كُلِّ بَارِحِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ كُلَّ غَادٍ وَرَائِحِ',
            letter: 'ح',
          ),
          KasydaBody(
            id: 'K7',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio7.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'رقيت بحب المصطفى كل شامخ',
            nameT: 'رَقِيتُ بِحُبِّ الْمُصْطَفَى كُلَّ شَامِخِ',
            kaseyda:
                'رقيت بحب المصطفى كل شامخ . من المجد يزري كل راس وراسخ بلى إنما حب الأمين كرامة . وقد فت مرادنا وكل المشايخ ومن يشتغل دهرا بحب محمد . ينل كل ما يهوى من اعلى البرازخ وقد جاءني منه البشارات إنني . بمدحي أسمو فوق كل الشوامخ وقد فرحت كل الحروف لأنها اكتـ . ـست حللا تلهي لناس وناسخ عليه صلاة الله ثم سلامه . صلاة تري مصري كإحدى النواسخ عليه صلاة الله ثم سلامه . صلاة بها أمسي غياثا لصارخ عليه صلاة الله ثم سلامه . وآل وصحب قد قفوا شرع ناسخ',
            kaseydaT:
                'رَقِيتُ بِحُبِّ الْمُصْطَفَى كُلَّ شَامِخِ . مِنَ الْمَجْدِ يُزْرِي كُلَّ رَاسٍ وَرَاسِخِ بَلَى إنَّمَا حُبُّ الْأَمِينِ كَرَامَةٌ . وَقَدْ فُتُّ مُرْادَنًا وَكُلَّ الْمَشَايِخِ وَمَنْ يَشْتَغِلْ دَهْرًا بِحُبِّ مُحَمَّدٍ . يَنَلْ كُلَّ مَا يَهْوَى مِنَ اعْلَى الْبَرَازِخِ وَقَدْ جَاءَنِي مِنْهُ الْبِشَارَاتُ إنَّنِي . بِمَدْحِيَ أَسْمُو فَوْقَ كُلِّ الشَّوَامِخِ وَقَدْ فَرِحَتْ كُلُّ الْحُرُوفِ لِأَنَّهَا اكْتَـ . ـسَتْ حُلَلًا تُلْهِي لِنَاسٍ وَنَاسِخِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً تُرِي مِصْرِي كَإحْدَى النَّوَاسِخِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أُمْسِي غِيَاثًا لِصَارِخِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ قَدْ قَفَوْا شَرْعَ نَاسِخِ',
            letter: 'خ',
          ),
          KasydaBody(
            id: 'K8',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio8.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'بدا لي أن المصطفى الدهر مرشدي',
            nameT: 'بَدَا لِيَ أَنَّ الْمُصْطَفَى الدَّهْرَ مُرْشِدِي',
            kaseyda:
                'بدا لي أن المصطفى الدهر مرشدي . ومهما يكن أمر فذلك مسندي فغوث وغيث منجد ومكرم . ومأوى لعاف وهو كهفي وصنددي بدا وبقاع الأرض ظلم وظلمة . فأشرقت الأرجا بطلعة أحمد وهذا أوان الخير منك فإنه . تلاطم أمواج لشر ممهد فهل لك أن تسدي إلينا كرامة . تجير عقول الكل يا خير منجد فإن تولني منك الجميل فأهله . وإن لم أكن أهلا فإنك مقصدي ومنك رسول الله نال خلافة . أبو البشر الأسمى أبو كل مرشد ومنك خليل والنجي وروحهم . أنيلوا مقامات على كل سيد كذا يشكر من قبلهم وسواهم . ومنك سليمان حوى كل سؤدد ومنك أروم الفوز والفضل والجدا . على رغم أنف من شناة وحسد وإن مرادي أن أنال خلافة . على وفق ما أهوى بجاه محمد بلا سبب مني معافى ومصطفى . خبيرا بصيرا هاديا كل مهتد وأقضي لكل الأولياء مرادهم . بلا كلفة في كل غيب ومشهد وأهدي الإمام المهدي الختم مرشدا . له كل وقت في مجال ومرقد بذاتك يا ربي بسر صفاته . ونورك يا ربي أبي كل محتد عليه صلاة الله ثم سلامه . مع الآل والصحب الكرام وأحمد',
            kaseydaT:
                'بَدَا لِيَ أَنَّ الْمُصْطَفَى الدَّهْرَ مُرْشِدِي . وَمَهْمَا يَكُنْ أَمْرٌ فَذَلِكَ مَسْنَدِي بَدَا وَبِقَاعِ الْأَرْضِ ظُلْمٌ وَظُلْمَةٌ .ومأوى لعاف وهو كهفي وصنددي بدا وبقاع الأرض ظلم وظلمة . فَأَشْرَقَتِ الْأَرْجَا بِطَلْعَةِ أَحْمَدِ وَهَذَا أَوَانُ الْخَيْرِ مِنْكَ فَإنَّهُ . تَلَاطُمُ أَمْوَاجٍ لِشَرٍّ مُمَهَّدِ فَهَلْ لَكَ أَنْ تُسْدِي إلَيْنَا كَرَامَةً . تُجِيرُ عُقُولَ الْكُلِّ يَا خَيْرَ مُنْجِدِ فَإنْ تُولِنِي مِنْكَ الْجَمِيلَ فَأَهْلُهُ . وَإنْ لَمْ أَكُنْ أَهْلًا فَإنَّكَ مَقْصَدِي وَمِنْكَ رَسُولُ اللهِ نَالَ خِلَافَةً . أَبُو الْبَشَرِ الْأَسْمَى أَبُو كُلِّ مُرْشِدِ وَمِنْكَ خَلِيلٌ وَالنَّجِيُّ وَرُوحُهُمْ . أُنِيلُوا مَقَامَاتٍ عَلَى كُلِّ سَيِّدِ كَذَا يَشْكُرٌ مِنْ قَبْلِهِمْ وَسِواهُمُ . وَمِنْكَ سُلَيْمَانٌ حَوَى كُلَّ سُؤْدَدِ وَمِنْكَ أَرُومُ الْفَوْزَ وَالْفَضْلَ وَالْجَدَا . عَلَى رَغْمِ أَنْفٍ مِنْ شُنَاةٍ وَحُسَّدِ وَإنَّ مُرَادِي أَنْ أَنَالَ خِلَافَةً . عَلَى وَفْقِ مَا أَهْوَى بِجَاهِ مُحَمَّدِ بِلَا سَبَبٍ مِنِّي مُعَافًى وَمُصْطَفًى . خَبِيرًا بَصِيرًا هَادِيًا كُلَّ مُهْتَدِ وَأَقْضِي لِكُلِّ الْأَوْلِيَاءِ مُرَادَهُمْ . بِلَا كُلْفَةٍ فِي كُلِّ غَيْبٍ وَمَشْهَدِ وَأَهْدِي الإمَامَ الْمَهْدِيَ الْخَتْمَ مُرْشِدًا . لَهُ كُلَّ وَقْتٍ فِي مَجَالٍ وَمَرْقَدِ بِذَاتِكَ يَا رَبِّي بِسِرِّ صِفَاتِهِ . وَنُورِكَ يَا رَبِّي أَبِي كُلِّ مَحْتِدِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . مَعَ الْآلِ وَالصَّحْبِ الْكِرَامِ وَأَحْمَدِ',
            letter: 'د',
          ),
          KasydaBody(
            id: 'K9',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio9.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'ذكرت رسول الله ذكر تلذذ',
            nameT: 'ذَكَرْتُ رَسُولَ اللهِ ذِكْرَ تَلَذُّذِ',
            kaseyda:
                'ذكرت رسول الله ذكر تلذذ . بشيء سواه الدهر لم أتلذذ وهل ثم غير المصطفى وجماله . وهل ثم من هاد سواه ومنقذ ذريني يا سلمى لهمي ووحشتي . أقاسي مريرا وهو عين تلذذي ذريني لتذكار الأمين فإنه . ملا القلب ما لي غير تذكار منقذي عليه صلاة الله ثم سلامه . صلاة بها ألفى لوصلك كالذي عليه صلاة الله ثم سلامه . صلاة بها أعلو على كل جهبذ عليه صلاة الله ثم سلامه . وآل وصحب عاينوا نور مأخذي',
            kaseydaT:
                'ذَكَرْتُ رَسُولَ اللهِ ذِكْرَ تَلَذُّذِ . بِشَيْءٍ سِوَاهُ الدَّهْرَ لَمْ أَتَلَذَّذِ وَهَلْ ثَمَّ غَيْرُ الْمُصْطَفَى وَجَمَالُهُ . وَهَلْ ثَمَّ مِنْ هَادٍ سِوَاهُ وَمُنْقِذِ ذَرِينِيَ يَا سَلْمَى لِهَمِّي وَوَحْشَتِي . أُقَاسِي مَرِيرًا وَهْوَ عَيْنُ تَلَذُّذِي ذَرِينِي لِتَذْكَارِ الْأَمِينِ فَإنَّهُ . مَلَا الْقَلْبَ مَا لِي غَيْرُ تَذْكَارِ مُنْقِذِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أُلْفَى لِوَصْلِكَ كَالذِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أَعْلُو عَلَى كُلِّ جِهْبِذِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ عَايَنُوا نُورَ مَأْخَذِي',
            letter: 'ذ',
          ),
          KasydaBody(
            id: 'K10',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio10.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'جعلت رجائي في الذي هو حاضري',
            nameT: 'جعلت رجائي في الذي هو حاضري',
            kaseyda:
                'جعلت رجائي في الذي هو حاضري . أبو  القاسم الماحي الضلال وناصري بقبض وبسط لا أؤمل غيره . ونعم سلاحي للعدو المكابر إذا حاز غيري عدة وعرمرما . فحسبي رسول الله عن كل ناصر ألم يرفعن عرب الجزيرة بعدما . حجوا فارسا تعلو الورى بالأكاسر وتحسب بالروم القياصر أنها . تسامى على أهل العلا والمعاشر فصاروا ملوك الأرض والكل تحتهم . وقد أرشدوا الأقيال فوق المنابر وفلوا شباة الماردين وزعزعوا . حصونا وأركان البغاة الجماهر ألم تعط للجيلي فوق مراده . بلا كلفة إذ جئته بالبشائر؟ ألم تنصب الشيخ التجاني خاتما . وأعليته فوق الشيوخ الأكابر؟ فهل لك في ذا العبد دون تأهل . منال فيمسي عده بالخناصر فهل لك في برهام يا خير مرسل . مساعدة في كل بطن وظاهر فهل لك فيه وهو عبد متيم . عطاء فيروي كل آت وصادر فأنت أمين الله خازن سره . وأنت الذي أولاك كل الذخائر فإنك يا ياسين عاقب حاشر الــ . ـمقفى ملاذي في الخطوب الدوائر فإنك يا خير الأنام محمدا . رجائي وسري في جميع المظاهر وأوليتني ما لست أهلا لبعضه . عليه صلاة الله يا خير حاشر عليك صلاة الله ثم سلامه . مع الآل والأصحاب أولي البصائر',
            kaseydaT:
                ' جعلت رجائي في الذي هو حاضري . أبو  القاسم الماحي الضلال وناصري . بِقَبْضٍ وَبَسْطٍ لَا أُؤَمِّلُ غَيْرَهُ . وَنِعْمَ سِلَاحِي لِلْعَدُوِّ الْمُكَابِرِ إذَا حَازَ غَيْرِي عُدَّةً وَعَرَمْرَمًا . فَحَسْبِي رَسُولُ اللهِ عَنْ كُلِّ نَاصِرِ أَلَمْ يَرْفَعَنْ عُرْبَ الْجَزِيرَةِ بَعْدَمَا . حَجَوْا فَارِسًا تَعْلُو الْوَرَى بِالْأَكَاسِرِ وَتَحْسِبِ بِالرُّومِ الْقَيَاصِرُ أَنَّهَا . تَسَامَى عَلَى أَهْلِ الْعُلَا وَالْمَعَاشِرِ فَصَارُوا مُلُوكَ الْأَرْضِ وَالْكُلُّ تَحْتَهُمْ . وَقَدْ أَرْشَدُوا الْأَقْيَالَ فَوْقَ الْمَنَابِرِ وَفَلُّوا شَبَاةَ الْمَارِدِينَ وَزَعْزَعُوا . حُصُونًا وَأَرْكَانَ الْبُغَاةِ الْجَمَاهِرِ أَلَمْ تُعْطِ لِلْجِيلِيِّ فَوْقَ مُرَادِهِ . بِلَا كُلْفَةٍ إذْ جِئْتَهُ بِالْبَشَائِرِ؟ أَلَمْ تَنْصِبِ الشَّيْخَ التِّجَانِيَّ خَاتِمًا . وَأَعْلَيْتَهُ فَوْقَ الشُّيُوخِ الْأَكَابِرِ؟ فَهَلْ لَكَ فِي ذَا الْعَبْدِ دُونَ تَأَهُّلٍ . مَنَالٌ فَيُمْسِي عَدُّهُ بِالْخَنَاصِرِ فَهَلْ لَكَ فِي بَرْهَامَ يَا خَيْرَ مُرْسَلٍ . مُسَاعَدَةٌ فِي كُلِّ بَطْنٍ وَظَاهِرِ فَهَلْ لَكَ فِيهِ وَهْوَ عَبْدٌ مُتَيَّمٌ . عَطَاءٌ فَيُرْوِي كُلَّ آتٍ وَصَادِرِ فَأَنْتَ أَمِينُ اللهِ خَازِنُ سِرِّهِ . وَأَنْتَ الذِي أَوْلَاكَ كُلَّ الذَّخَائِرِ فَإنَّكَ يَا يَاسِينُ عَاقِبُ حَاشِرُ الْــ . ـمُقَفَّى مَلَاذِي فِي الْخُطُوبِ الدَّوَائِرِ فَإنَّكَ يَا خَيْرَ الْأَنَامِ مُحَمَّدًا . رَجَائِي وَسِرِّي فِي جَمِيعِ الْمَظَاهِرِ وَأَوْلَيْتَنِي مَا لَسْتُ أَهْلًا لِبَعْضِهِ . عَلَيْهِ صَلَاةُ اللهِ يَا خَيْرَ حَاشِرِ عَلَيْكَ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . مَعَ الْآلِ وَالْأَصْحَابِ أُوِلي الْبَصَائِرِ',
            letter: 'ر',
          ),
          KasydaBody(
            id: 'K11',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio11.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'ثوى حب خير الخلق في خلدي فوزا',
            nameT: 'ثَوَى حُبُّ خَيْرِ الْخَلْقِ فِي خَلَدِي فَوْزَا',
            kaseyda:
                'ثوى حب خير الخلق في خلدي فوزا . وقد نلت منه السر والعلم والكنزا إمام وهاد في مشاهد دهشة . لدى عالم الأرواح قد أوضح الرمزا بلى قال مهما الحق قال تجليا . ألست برب قبل أن زخرفوا العزى فقال جميع الرسل ما قال مرشدي . وكل نبي ثم من عرفوا الميزا فكان إمام الكل للكل قائدا . فمنه جميعا ما إلى الرشد قد يعزى عليه صلاة الله ثم سلامه . أنال بها العلياء والرشد والفوزا عليه صلاة الله ثم سلامه . تزيل طخاء القلب والهمز واللمزا عليه صلاة الله ثم سلامه . بها قد تقيني السحر والضرب والوكزا عليه صلاة الله ثم سلامه . تسخر لي دهري ولم ألكزن لكزا عليه صلاة الله ثم سلامه . وآل وصحب قد أنلنا بهم عزا',
            kaseydaT:
                'ثَوَى حُبُّ خَيْرِ الْخَلْقِ فِي خَلَدِي فَوْزَا . وَقَدْ نِلْتُ مِنْهُ السِّرَّ وَالْعِلْمَ وَالْكَنْزَا إمَامٌ وَهَادٍ فِي مَشَاهِدِ دَهْشَةٍ . لَدَى عَالَمِ الْأَرْوَاحِ قَدْ أَوْضَحَ الرَّمْزَا بَلَى قَالَ مَهْمَا الْحَقُّ قَالَ تَجَلِّيًا . أَلَسْتُ بِرَبٍّ قَبْلَ أَنْ زَخْرَفُوا الْعُزَّى فَقَالَ جَمِيعُ الرُّسْلِ مَا قَالَ مُرْشِدِي . وَكُلُّ نَبِيٍّ ثُمَّ مَنْ عَرَفُوا الْمَيْزَا فَكَانَ إمَامَ الْكُلِّ لِلْكُلِّ قَائِدًا . فَمِنْهُ جَمِيعًا مَا إلَى الرُّشْدِ قَدْ يُعْزَى عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . أَنَالُ بِهَا الْعَلْيَاءَ وَالرُّشْدَ وَالْفَوْزَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُزِيلُ طَخَاءَ الْقَلْبِ وَالْهَمْزَ وَاللَّمْزَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . بِهَا قَدْ تَقِينِي السِّحْرَ وَالضَّرْبَ وَالْوَكْزَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُسَخِّرُ لِي دَهْرِي وَلَمْ أُلْكَزَنْ لَكْزَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ قَدْ أُنِلْنَا بِهِمْ عِزَّا',
            letter: 'ز',
          ),
          KasydaBody(
            id: 'K12',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio12.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'فهل لك أن تنحو لنحو المؤسس',
            nameT: 'فَهَلْ لَكَ أَنْ تَنْحُو لِنَحْوِ الْمُؤَسِّسِ',
            kaseyda:
                'فهل لك أن تنحو لنحو المؤسس . محمد الماحي حبيبي المقدس أناديه يا طه وأحمد عاقب . وحاشر يا هادي العباد المؤسس محمد محمود محمد حامد . محمد المختار ماحي العرندس4 هو المصطفى المحبوب وهو المزمل الـ . ـمدثر ياسين علا كل أقدس عليه صلاة الله ثم سلامه . صلاة تنيل العبد كل تقدس عليه صلاة الله ثم سلامه . وألمس قرب المقتفى كل ملمس عليه صلاة الله ثم سلامه . وآل وصحب تزدري كل نرجس',
            kaseydaT:
                'فَهَلْ لَكَ أَنْ تَنْحُو لِنَحْوِ الْمُؤَسِّسِ . مُحَمَّدٍ الْمَاحِي حَبِيبِي الْمُقَدَّسِ أُنَادِيهِ يَا طَهَ وَأَحْمَدُ عَاقِبٌ . وَحَاشِرُ يَا هَادِي الْعِبَادِ الْمُؤَسِّسِ مُحَمَّدُ مَحْمُودٌ مُحَمَّدُ حَامِدٌ . مُحَمَّدٌ الْمُخْتَارُ مَاحِي الْعَرَنْدَسِ4 هُوَ الْمُصْطَفَى الْمَحْبُوبُ وَهْوَ الْمُزَمِّلْ الْـ . ـمُدَثِّرُ يَاسِينٌ عَلَا كُلَّ أَقْدَسِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً تُنِيلُ الْعَبْدَ كُلَّ تَقَدُّسِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَأَلْمَسُ قُرْبَ الْمُقْتَفَى كُلَّ مَلْمَسِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ تَزْدَرِي كُلَّ نَرْجِسِ',
            letter: 'س',
          ),
          KasydaBody(
            id: 'K13',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio13.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'سلام على عهن وبير أريس',
            nameT: 'سَلَامٌ عَلَى عِهْنٍ وَبِيرِ أَرِيسِ',
            kaseyda:
                'سلام على عهن وبير أريس . تحن قلامي نحوها ونقوسي مشارب خير الخلق صفوة خلقه . وأعظم ملك ساس كل نفوس وقد أفصحت نطق الجمادات أنه . لأفضل مخلوق غزا بخميس وقد برعت في العلم عجم بسره . وطاوعه للرشد كل رئيس وقد سحقت أصحابه كل مجرم . وقد عبقت بالطيب بير أريس عليه صلاة الله ثم سلامه . وآل وصحب قد سخوا بنفيس',
            kaseydaT:
                'سَلَامٌ عَلَى عِهْنٍ وَبِيرِ أَرِيسِ . تَحِنُّ قِلَامِي نَحْوَهَا وَنُقُوسِي مَشَارِبُ خَيْرِ الْخَلْقِ صَفْوَةِ خَلْقِهِ . وَأَعْظَمِ مُلْكٍ سَاسَ كُلَّ نُفُوسِ وَقَدْ أَفْصَحَتْ نُطْقُ الْجَمَادَاتِ أَنَّهُ . لَأَفْضَلُ مَخْلُوقٍ غَزَا بِخَمِيسِ وَقَدْ بَرَعَتْ فِي الْعِلْمِ عُجْمٌ بِسِرِّهِ . وَطَاوَعَهُ لِلرُّشْدِ كُلُّ رَئِيسِ وَقَدْ سَحَقَتْ أَصْحَابُهُ كُلَّ مُجْرِمٍ . وَقَدْ عَبِقَتْ بِالطِّيبِ بِيرُ أَرِيسِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ قَدْ سَخَوْا بِنَفِيسِ',
            letter: 'س',
          ),
          KasydaBody(
            id: 'K14',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio14.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'ضمنت مديح الهاشمي وقد رشا',
            nameT: 'ضَمِنْتُ مَدِيحَ الْهَاشِمِيِّ وَقَدْ رَشَا',
            kaseyda:
                'ضمنت مديح الهاشمي وقد رشا . قديما بقلبي نور أمداحه رشا وذلك محمود المقام وإنه . أماني مدى الأيام عن كل ما يخشى حما عن جنابي كل ظلم وظلمة . وزحزح عني الغل والحقد والغشا وأشرق بالأنوار قلبي وقالبي . محمد شمس الدين من قد أضا الغطشا فإن عمي الأقوام يوما وأمرقوا . فلي قائد من نوره وسط الممشى يؤيدني في كل مشهد دهشة . أبو القاسم المفضال من أجل ما رشا عليه صلاة الله ثم سلامه . صلاة وتسليما تلين لنا العيشا عليه صلاة الله ثم سلامه . تحلي كلامي والمهارق والنقشا عليه صلاة الله ثم سلامه . أكون سواه لن أرجي ولن أخشى عليه صلاة الله ثم سلامه . وآل وصحب حاربوا كل من غشا',
            kaseydaT:
                'ضَمِنْتُ مَدِيحَ الْهَاشِمِيِّ وَقَدْ رَشَا . قَدِيمًا بِقَلْبِي نُورُ أَمْدَاحِهِ رَشَا وَذَلِكَ مَحْمُودُ الْمَقَامِ وَإنَّهُ . أَمَانِي مَدَى الْأَيَّامِ عَنْ كُلِّ مَا يُخْشَى حَمَا عَنْ جَنَابِي كُلَّ ظُلْمٍ وَظُلْمَةٍ . وَزَحْزَحَ عَنِّي الْغِلَّ وَالْحِقْدَ وَالْغِشَّا وَأَشْرَقَ بِالْأَنْوَارِ قَلْبِي وَقَالَبِي . مُحَمَّدُ شَمْسُ الدِّينِ مَنْ قَدْ أَضَا الْغَطْشَا فَإنْ عَمِيَ الْأَقْوَامُ يَوْمًا وَأَمْرَقُوا . فَلِي قَائِدٌ مِنْ نُورِهِ وَسَطَ الْمَمْشَى يُؤَيِّدُنِي فِي كُلِّ مَشْهَدِ دَهْشَةٍ . أَبُو الْقَاسِمِ الْمِفْضَالُ مِنْ أَجْلِ مَا رَشَّا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً وَتَسْلِيمًا تُلِينُ لَنَا الْعَيْشَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُحَلِّي كَلَامِي وَالْمَهَارِقَ وَالنَّقْشَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . أَكُونُ سِوَاهُ لَنْ أُرَجِّي وَلَنْ أَخْشَى عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ حَارَبُوا كُلَّ مَنْ غَشَّا',
            letter: 'ش',
          ),
          KasydaBody(
            id: 'K15',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio15.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'صفا وقت هذا العبد حين تخلصا',
            nameT: 'صَفَا وَقْتُ هَذَا الْعَبْدِ حِينَ تَخَلَّصَا',
            kaseyda:
                'صفا وقت هذا العبد حين تخلصا . وفك من الأغيار والحب أخلصا وذاك بحبي للأمين وذكره . وقد خجل الواشون ممن تربصا وقاية ربي أغنت العبد سرمدا . إلى جانبي من كاد لن يتخلصا كذا حزبه تكفي العدى فتراهم . بساحتهم صرعى جزاء لمن عصا7 أراني منصورا بسر محمد . عليه صلاة قد تعم مخصصا عليه صلاة الله ثم سلامه . صلاة وتسليما يوافيه مخلصا عليه صلاة الله ثم سلامه . ينال عدوي منه دهرا تنقصا عليه صلاة الله ثم سلامه . أرى الدهر قرطاسي لمدحك بصبصا8 عليه صلاة الله ثم سلامه . ملابس تقوى الله كي أتقمصا عليه صلاة الله ثم سلامه . وآل وأصحاب ومن قد تخصصا',
            kaseydaT:
                'صَفَا وَقْتُ هَذَا الْعَبْدِ حِينَ تَخَلَّصَا . وَفُكَّ مِنَ الْأَغْيَارِ وَالْحُبَّ أَخْلَصَا وَذَاكَ بِحُبِّي لِلْأَمِينِ وَذِكْرِهِ . وَقَدْ خَجِلَ الْوَاشُونَ مِمَّنْ تَرَبَّصَا وِقَايَةُ رَبِّي أَغْنَتِ الْعَبْدَ سَرْمَدًا . إلَى جَانِبِي مَنْ كَادَ لَنْ يَتَخَلَّصَا كَذَا حِزْبَهُ تَكْفِي الْعِدَى فَتَرَاهُمُ . بِسَاحَتِهِمْ صَرْعَى جَزَاءً لِمَنْ عَصَا7 أَرَانِيَ مَنْصُورًا بِسِرِّ مُحَمَّدٍ . عَلَيْهِ صَلَاةٌ قَدْ تَعُمُّ مُخَصَّصَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً وَتَسْلِيمًا يُوَافِيهِ مُخْلَصَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . يَنَالُ عَدُوِّي مِنْهُ دَهْرًا تَنَقُّصَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . أَرَى الدَّهْرَ قِرْطَاسِي لِمَدْحِكَ بَصْبَصَا8 عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . مَلَابِسَ تَقْوَى اللهِ كَيْ أَتَقَمَّصَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَأَصْحَابٍ وَمَنْ قَدْ تَخَصَّصَا',
            letter: 'ص',
          ),
          KasydaBody(
            id: 'K16',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio16.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'تكدرت الدنيا وزلزلت الأرض',
            nameT: 'تكدرت الدنيا وزلزلت الأرض',
            kaseyda:
                'تكدرت الدنيا وزلزلت الأرض . وغيرك رب المصطفى عدم محض. عسى المصطفى باب الإله بفضله . ينيل لنا بسطا به يرفع القبض هو البحر وهو المصطفى القرم جوده . به فاضت الأنوار واتسع الفيض وقد آن منه أن يجود بنظرة . فما السود ترجو غير طه ولا البيض وقد جاءنا منا رؤوفا بكلنا . رحيما حريصا حقه الدهر لن نقضوا وقد بلغ المختار أدى أمانة . وناصحنا كلا وما سعد البعض وقد ساد سودان بحب نبينا . وقد ذل بيض في سرائرهم بغض عليه صلاة الله ثم سلامه . صلاة نرى في حصنها حيثما نمضو عليه صلاة الله ثم سلامه . تجود لنا الأنواء والنبت والأرض عليه صلاة الله ثم سلامه . وآل وأصحاب على الدين قد حضوا',
            kaseydaT:
                'تكدرت الدنيا وزلزلت الأرض . وغيرك رب المصطفى عدم محض . عَسَى الْمُصْطَفَى بَابُ الْإلَهِ بِفَضْلِهِ . يُنِيلُ لَنَا بَسْطًا بِهِ يُرْفَعُ الْقَبْضُ هُوَ الْبَحْرُ وَهْوَ الْمُصْطَفَى الْقَرْمُ جُودُهُ . بِهِ فَاضَتِ الْأَنْوَارُ وَاتَّسَعَ الْفَيْضُ وَقَدْ آنَ مِنْهُ أَنْ يَجُودَ بِنَظْرَةٍ . فَمَا السُّودُ تَرْجُو غَيْرَ طَهَ وَلَا الْبِيضُ وَقَدْ جَاءَنَا مِنَّا رَؤُوفًا بِكُلِّنَا . رَحِيمًا حَرِيصًا حَقَّهُ الدَّهْرَ لَنْ نَقْضُوا وَقَدْ بَلَغَ الْمُخْتَارُ أَدَّى أَمَانَةً . وَنَاصَحَنَا كُلًّا وَمَا سَعِدَ الْبَعْضُ وَقَدْ سَادَ سُودَانٌ بِحُبِّ نَبِيِّنَا . وَقَدْ ذَلَّ بِيضٌ فِي سَرَائِرِهِمْ بُغْضُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً نُرَى فِي حِصْنِهَا حَيْثُمَا نَمْضُو عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تَجُودُ لَنَا الْأَنْوَاءُ وَالنَّبْتُ وَالْأَرْضُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَأَصْحَابٍ عَلَى الدِّينِ قَدْ حَضُّوا',
            letter: '',
          ),
          KasydaBody(
            id: 'K17',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio17.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'خليلي صفا وقتي وتم لي البسط',
            nameT: 'خَلِيلِي صَفَا وَقْتِي وَتَمَّ لِيَ الْبَسْطُ',
            kaseyda:
                'خليلي صفا وقتي وتم لي البسط . ولم أر للصب العليل دوا قط وذاك لمن يهوى الأمين كرامة . فما حبه إلا السعادة والقسط فمن جوده الكونان والأمر ثم ما . تعالى وحب  المصطفى ردع من يسطو رسول ثوى في الغيب دهرا موحدا . وما ثم من ينفي وتم له البسط وكان رسولا حين آدم طينة . وماء فما الجدوى لعاو وما الخبط عليه صلاة الله ثم سلامه . صلاة بها ينزاح عن أرضنا القحط عليه صلاة الله ثم سلامه . وتعلو سطوري ثم شكلي كذا النقط عليه صلاة الله ثم سلامه . يزيد غرامي العمر والشيب والشمط عليه صلاة الله ثم سلامه . وآل وصحب في سوى الدين لم يسطوا',
            kaseydaT:
                'خَلِيلِي صَفَا وَقْتِي وَتَمَّ لِيَ الْبَسْطُ . وَلَمْ أَرَ لِلصَّبِّ الْعَلِيلِ دَوًا قَطُّ وَذَاكَ لِمَنْ يَهْوَى الْأَمِينَ كَرَامَةٌ . فَمَا حُبُّهُ إلَّا السَّعَادَةُ وَالْقِسْطُ فَمِنْ جُودِهِ الْكَوْنَانِ وَالْأَمْرُ ثُمَّ مَا . تَعَالَى وَحُبُّ  الْمُصْطَفَى رَدْعُ مَنْ يَسْطُو رَسُولٌ ثَوَى فِي الْغَيْبِ دَهْرًا مُوَحِّدًا . وَمَا ثَمَّ مَنْ يَنْفِي وَتَمَّ لَهُ الْبَسْطُ وَكَانَ رَسُولًا حِينَ آدَمُ طِينَةٌ . وَمَاءٌ فَمَا الْجَدْوَى لِعَاوٍ وَمَا الْخَبْطُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا يَنْزَاحُ عَنْ أَرْضِنَا الْقَحْطُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَتَعْلُو سُطُورِي ثُمَّ شَكْلِي كَذَا النَّقْطُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . يَزِيدُ غَرَامِي الْعُمْرُ وَالشَّيْبُ وَالشَّمْطُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ فِي سِوَى الدِّينِ لَمْ يَسْطُوا',
            letter: 'ط',
          ),
          KasydaBody(
            id: 'K18',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio18.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'هويت رسول الله طه المشفعا',
            nameT: 'هَوِيتُ رَسُولَ اللهِ طَهَ الْمُشَفَّعَا',
            kaseyda:
                'هويت رسول الله طه المشفعا . لدى الحق من قصر الضلالة زعزعا وشتت شمل الكفر أمست ربوعه . يبابا ونور الحق قهرا تشعشعا أعوذ برب العرش جل جلاله . من امساك دين حبله قد تقطعا أعوذ برب الناس مالك سرهم . من السلب أو أن للعدى أتضعضعا أعوذ برب الخلق والأمر أن أرى . بعيني ركن الدين يوما تصدعا وأسأل يا قيوم يا حي ربنا . بأن تنصر الدين القويم الموسعا بجاه رسول الله أحمد مقتفى . أبي القاسم الماحي ضلالا مشيعا عليه صلاة الله ثم سلامه . صلاة بها ذا العبد دهرا تمتعا عليه صلاة الله ثم سلامه . صلاة بها ذا العبد يلفى متبعا عليه صلاة الله ثم سلامه . صلاة تصير العبد دهرا مترعا عليه صلاة الله ثم سلامه . صلاة بها أمسي كريما موسعا عليه صلاة الله ثم سلامه . صلاة بها ألفي فؤادي مقنعا عليه صلاة الله ثم سلامه . صلاة أرى دهري بها متدرعا عليه صلاة الله ثم سلامه . بها يرزق الأحباب حصنا ممنعا عليه صلاة الله ثم سلامه . بها ندم لمن لذا الفيض شنعا عليه صلاة الله ثم سلامه . بها سخر الجرمان إن حل مربعا عليه مع الآل الكرام وصحبه . ومن سلكوا نهج الأمين تطوعا',
            kaseydaT:
                'هَوِيتُ رَسُولَ اللهِ طَهَ الْمُشَفَّعَا . لَدَى الْحَقِّ مَنْ قَصْرَ الضَّلَالَةِ زَعْزَعَا وَشَتَّتَ شَمْلَ الْكُفْرِ أَمْسَتْ رُبُوعُهُ . يَبَابًا وَنُورُ الْحَقِّ قَهْرًا تَشَعْشَعَا أَعُوذُ بِرَبِّ الْعَرْشِ جَلَّ جَلَالُهُ . مِنِ امْسَاكِ دِينٍ حَبْلُهُ قَدْ تَقَطَّعَا أَعُوذُ بِرَبِّ النَّاسِ مَالِكِ سِرِّهِمْ . مِنَ السَّلْبِ أَوْ أَنْ لِلْعِدَى أَتَضَعْضَعَا أَعُوذُ بِرَبِّ الْخَلْقِ وَالْأَمْرِ أَنْ أرَى . بِعَيْنَيَّ رُكْنَ الدِّينِ يَوْمًا تَصَدَّعَا وَأَسْأَلُ يَا قَيُّومُ يَا حَيُّ رَبَّنَا . بِأَنْ تَنْصُرَ الدِّينَ الْقَوِيمَ الْمُوَسَّعَا بِجَاهِ رَسُولِ اللهِ أَحْمَدَ مُقْتَفًى . أَبِي الْقَاسِمِ الْمَاحِي ضَلَالًا مُشَيَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا ذَا الْعَبْدُ دَهْرًا تَمَتَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا ذَا الْعَبْدُ يُلْفَى مُتَبَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً تُصِيرُ الْعَبْدَ دَهْرًا مُتَرَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أُمْسِي كَرِيمًا مُوَسَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أُلْفِي فُؤَادِي مُقَنَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً أَرَى دَهْرِي بِهَا مُتَدَرِّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . بِهَا يُرْزَقُ الْأَحْبَابُ حِصْنًا مُمَنَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . بِهَا نَدَمٌ لِمَنْ لِذَا الْفَيْضِ شَنَّعَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . بِهَا سُخِّرَ الْجِرْمَانُ إنْ حَلَّ مَرْبَعَا عَلَيْهِ مَعَ الْآلِ الْكِرَامِ وَصَحْبِهِ . وَمَنْ سَلَكُوا نَهْجَ الْأَمِينِ تَطَوُّعَا',
            letter: 'ع',
          ),
          KasydaBody(
            id: 'K19',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio19.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'غرامي دعاني للفريش ورابغ',
            nameT: 'غَرَامِي دَعَانِي لِلْفُرَيْشِ وَرَابِغِ',
            kaseyda:
                'غرامي دعاني للفريش ورابغ . وطيبة خير الخلق معطي السوابغ سلام على بيري علي ورومة . فمن لي بكأس من بضاعة سائغ سلام على زرقاء عين وقد سمت . على الحور وا شوقي لسلع ورابغ سلام على قبر الأمين وروضة . تريك ضياء يزدري كل بازغ سلام على روض البقيع فإنني . يؤدي سلامي كل آت وبالغ محا حبها حب القرى من خواطري . فما لندنا ذات الشموع البوازغ وذلك من حب الحبيب فحبه . متى يقذفن في القلب أعظم دامغ عليه صلاة الله ثم سلامه . ويصبغ قلب العبد من خير صابغ عليه صلاة الله ثم سلامه . وتستأصل الأعداء من كل زائغ عليه صلاة الله ثم سلامه . وأكسى كسا الأنوار من كل سابغ عليه صلاة الله ثم سلامه . وآل وصحب أنذروا كل بالغ',
            kaseydaT:
                'غَرَامِي دَعَانِي لِلْفُرَيْشِ وَرَابِغِ . وَطَيْبَةِ خَيْرِ الْخَلْقِ مُعْطِي السَّوَابِغِ سَلَامٌ عَلَى بِيرَيْ عَلِيٍّ وَرُومَةٍ . فَمَنْ لِي بِكَأْسٍ مِنْ بِضَاعَةِ سَائِغِ سَلَامٌ عَلَى زَرْقَاءِ11 عَيْنٍ وَقَدْ سَمَتْ . عَلَى الْحُورِ وَا شَوْقِي لِسَلْعٍ وَرَابِغِ سَلَامٌ عَلَى قَبْرِ الْأَمِينِ وَرَوْضَةٍ . تُرِيكَ ضِيَاءً يَزْدَرِي كُلَّ بَازِغِ سَلَامٌ عَلَى رَوْضِ الْبَقِيعِ فَإنَّنِي . يُؤَدِّي سَلَامِي كُلُّ آتٍ وَبَالِغِ مَحَا حُبُّهَا حُبَّ الْقُرَى مِنْ خَوَاطِرِي . فَمَا لُنْدُنًا ذَاتُ الشُّمُوعِ الْبَوَازِغِ وَذَلِكَ مِنْ حُبِّ الْحَبِيبِ فَحُبُّهُ . مَتَى يُقْذَفَنْ فِي الْقَلْبِ أَعْظَمُ دَامِغِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَيَصْبَغُ قَلْبَ الْعَبْدِ مِنْ خَيْرِ صَابِغِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَتَسْتَأْصِلُ الْأَعْدَاءَ مِنْ كُلِّ زَائِغِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَأُكْسَى كِسَا الْأَنْوَارِ مِنْ كُلِّ سَابِغِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ أَنْذَرُوا كُلَّ بَالِغِ',
            letter: 'غ',
          ),
          KasydaBody(
            id: 'K20',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio20.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'نوال رسول الله أصبح واكفا',
            nameT: 'نَوَالُ رَسُولِ اللهِ أَصْبَحَ وَاكِفَا',
            kaseyda:
                'نوال رسول الله أصبح واكفا . علي متى أمسيت بالمدح واصفا فجود رسول الله بالبذل سائل . وألفى على أبوابه الدهر عاكفا فإني راض شاكر القلب دائما . ولم يغنني نيل عن الوصل عارفا ولست بأهل أن أنال كرامة . ولكن خير الخلق ساد الغطارفا12 وإني أتاني حبه قبل نشأتي . صرفت تليد الحب فيه وطارفا إذا هام أقراني بميلى وتندم . أهيم به حينا ووقتا وآنفا وإن سهر العباد في درس حزبهم . فحزبي هيامي في سنا البدر غارفا أساجل فيه الورق شوقا مراعيا . نجوم السما ليلي وأسبل واكفا فلم أر من أهل الصبابة مثل من . يعاني لما عانيت بله السفاسفا زفيري ودمعي يشفياني كلاهما . وإني على ذا في جناني قاطفا فعز بذل لذة بمرارة . وألتذ إن غيري يقاسي المتالفا بيمن رسول الله كهفي وملجئي . ومن ساد من نالوا العطايا النفانفا عليه صلاة الله ثم سلامه . وآل وأصحاب أنالوا العوارفا',
            kaseydaT:
                'نَوَالُ رَسُولِ اللهِ أَصْبَحَ وَاكِفَا . عَلَيَّ مَتَى أَمْسَيْتُ بِالْمَدْحِ وَاصِفَا فَجُودُ رَسُولِ اللهِ بِالْبَذْلِ سَائِلٌ . وَأُلْفَى عَلَى أَبْوَابِهِ الدَّهْرَ عَاكِفَا فَإنِّيَ رَاضٍ شَاكِرُ الْقَلْبِ دَائِمًا . وَلَمْ يُغْنِنِي نَيْلٌ عَنِ الْوَصْلِ عَارِفَا وَلَسْتُ بِأَهْلٍ أَنْ أَنَالَ كَرَامَةً . وَلَكِنَّ خَيْرَ الْخَلْقِ سَادَ الْغَطَارِفَا وَإنِّي أَتَانِي حُبُّهُ قَبْلَ نَشْأَتِي . صَرَفْتُ تَلِيدَ الْحُبِّ فِيهِ وَطَارِفَا إذَا هَامَ أَقْرَانِي بِمَيْلِى وَتَنْدَمٍ . أَهِيمُ بِهِ حِينًا وَوَقْتًا وَآنِفَا وَإنْ سَهِرَ الْعُبَّادُ فِي دَرْسِ حِزْبِهِمْ . فَحِزْبِي هُيَامِي فِي سَنَا الْبَدْرِ غَارِفَا أُسَاجِلُ فِيهِ الْوُرْقَ شَوْقًا مُرَاعِيًا . نُجُومَ السَّمَا لَيْلِي وَأُسْبِلُ وَاكِفَا فَلَمْ أَرَ مِنْ أَهْلِ الصَّبَابَةِ مِثْلَ مَنْ . يُعَانِي لِمَا عَانَيْتُ بَلْهَ السَّفَاسِفَا زَفِيرِي وَدَمْعِي يَشْفِيَانِي كِلَاهُمَا . وَإنِّي عَلَى ذَا فِي جِنَانِيَ قَاطِفَا فَعِزّ بِذُلٍّ لَذَّةٌ بِمَرَارَةٍ . وَأَلْتَذُّ إنْ غَيْرِي يُقَاسِي الْمَتَالِفَا بِيُمْنِ رَسُولِ اللهِ كَهْفِي وَمَلْجَئِي . وَمَنْ سَادَ مَنْ نَالُوا الْعَطَايَا النَّفَانِفَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَأَصْحَابٍ أَنَالُوا الْعَوَارِفَا',
            letter: 'ف',
          ),
          KasydaBody(
            id: 'K21',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio21.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'طحنت بخير الخلق أقوى الوثائق',
            nameT: 'طَحَنْتُ بِخَيْرِ الْخَلْقِ أَقْوَى الْوَثَائِقِ',
            kaseyda:
                'طحنت بخير الخلق أقوى الوثائق . ممالك أبناء البغاة الفواسق سلاحي رسول الله وهو تحصني . وخيلي ورجلي فهو سر الحقائق حمى عن ديوري كل ضنك وفتنة . وزحزح عنها كل باغ وفاسق وساق رجال الخير إذ يقصدونها . وألهم صحبي ذوق كل الرقائق علي خديمي خازن السر كاتبي . بتزيين مدحي قد علا كل فائق فإن مديحي للأمين طريقة . لإدراك فيض دونه كل سابق فإن رسول الله وهو مساعدي . محيط بسر الله رب الخلائق ومن بحره للصحب أمسيت غارفا . على وفق ما يرجون من فضل خالقي عليه صلاة الله ثم سلامه . صلاة بها أروي ظما كل وامق عليه صلاة الله ثم سلامه . وينسخ نهج الختم كل طرائق عليه صلاة الله ثم سلامه . صلاة بها تسقي الملوك حدائقي عليه صلاة الله ثم سلامه . تزين سطوري الدهر بيض المهارق عليه مع الآل الكرام وصحبه . بحور الندى أسد الوغى والمضايق',
            kaseydaT:
                'طَحَنْتُ بِخَيْرِ الْخَلْقِ أَقْوَى الْوَثَائِقِ . مَمَالِكَ أَبْنَاءِ الْبُغَاةِ الْفَوَاسِقِ سِلَاحِي رَسُولُ اللهِ وَهْوَ تَحَصُّنِي . وَخَيْلِي وَرَجْلِي فَهْوَ سِرُّ الْحَقَائِقِ حَمَى عَنْ دُيُورِي كُلَّ ضَنْكٍ وَفِتْنَةٍ . وَزَحْزَحَ عَنْهَا كُلَّ بَاغٍ وَفَاسِقِ وَسَاقَ رِجَالَ الْخَيْرِ إذْ يَقْصِدُونَهَا . وَأَلْهَمَ صَحْبِي ذَوْقَ كُلِّ الرَّقَائِقِ عَلَيَّ خَدِيمِي خَازِنُ السِّرِّ كَاتِبِي . بِتَزْيِينِ مَدْحِي قَدْ عَلَا كُلَّ فَائِقِ فَإنَّ مَدِيحِي لِلْأَمِينِ طَرِيقَةٌ . لِإدْرَاكِ فَيْضٍ دُونَهُ كُلُّ سَابِقِ فَإنَّ رَسُولَ اللهِ وَهْوَ مُسَاعِدِي . مُحِيطٌ بِسِرِّ اللهِ رَبِّ الْخَلَائِقِ وَمِنْ بَحْرِهِ لِلصَّحْبِ أَمْسَيْتُ غَارِفًا . عَلَى وَفْقِ مَا يَرْجُونَ مِنْ فَضْلِ خَالِقِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أُرْوِي ظَمَا كُلِّ وَامِقِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَيَنْسَخُ نَهْجَ الْخَتْمِ كُلَّ طَرَائِقِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا تَسْقِي الْمُلُوكُ حَدَائِقِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تَزِينُ سُطُورِي الدَّهْرَ بِيضُ الْمَهَارِقِ عليه مع الآل الكرام وصحبه . بُحُورِ النَّدَى أُسْدِ الْوَغَى وَالْمَضَايِقِ',
            letter: 'ق',
          ),
          KasydaBody(
            id: 'K22',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio22.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'ألما على البحر المحيط وتتركا',
            nameT: 'أَلِمَّا عَلَى الْبَحْرِ الْمُحِيطِ وَتَتْرُكَا',
            kaseyda:
                'ألما على البحر المحيط وتتركا . سواقي لا تجدي ظماء لمن شكا فأعني حبيب الله طه محمدا . أبا القاسم الهادي لمن قد تنسكا أمين إله العرش مركز سره . به هام قلب العبد حتى تهتكا فملكته ذاتي ونفسي وروحها . وأهلي وأولادي ومن بي تمسكا ولست أرى في الكون شيئا أحبه . سوى المصطفى المحمود فيك وعندكا فوقت مضى في غير إنشاء مدحه . وتذكاره لم أحجه الدهر مدركا عليه صلاة الله ثم سلامه . وتعلي على كل الملوك عبيدكا عليه صلاة الله ثم سلامه . تنيل المنى ولتعط للعبد سركا عليه صلاة الله ثم سلامه . تملكني التكوين والأمر أمركا عليه صلاة الله ثم سلامه . تورثني من فات ممن تملكا عليه مع الآل الكرام وصحبه . صلاة وتسليم وأنحو لنحوكا',
            kaseydaT:
                'أَلِمَّا عَلَى الْبَحْرِ الْمُحِيطِ وَتَتْرُكَا . سَوَاقِيَ لَا تُجْدِي ظِمَاءً لِمَنْ شَكَا فَأَعْنِي حَبِيبَ اللهِ طَهَ مُحَمَّدًا . أَبَا الْقَاسِمِ الْهَادِي لِمَنْ قَدْ تَنَسَّكَا أَمِينَ إلَهِ الْعَرْشِ مَرْكزَ سِرِّهِ . بِهِ هَامَ قَلْبُ الْعَبْدِ حَتَّى تَهَتَّكَا فَمَلَّكْتُهُ ذَاتِي وَنَفْسِي وَرُوحَهَا . وَأَهْلِي وَأَوْلَادِي وَمَنْ بِي تَمَسَّكَا وَلَسْتُ أَرَى فِي الْكَوْنِ شَيْئًا أُحِبُّهُ . سِوَى الْمُصْطَفَى الْمَحْمُودِ فِيكَ وَعِنْدَكَا فَوَقْتٌ مَضَى فِي غَيْرِ إنْشَاءِ مَدْحِهِ . وَتَذْكَارِهِ لَمْ أَحْجُهُ الدَّهْرَ مُدْرَكَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَتُعْلِي عَلَى كُلِّ الْمُلُوكِ عَبِيدَكَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُنِيلُ الْمُنَى وَلْتُعْطِ لِلْعَبْدِ سِرَّكَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُمَلِّكُنِي التَّكْوِينَ وَالْأَمْرُ أَمْرُكَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُوَرِّثُنِي مَنْ فَاتَ مِمَّنْ تَمَلَّكَا عَلَيْهِ مَعَ الْآلِ الْكِرَامِ وَصَحْبِهِ . صَلَاةٌ وَتَسْلِيمٌ وَأَنْحُو لِنَحْوِكَا',
            letter: 'ك',
          ),
          KasydaBody(
            id: 'K23',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio23.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'يهيج أفكاري لمدح المزمل',
            nameT: 'يُهَيِّجُ أَفْكَارِي لِمَدْحِ الْمُزَمِّلِ',
            kaseyda:
                'يهيج أفكاري لمدح المزمل . غرامي وشوقي للجمال المكمل دعاني جمال المصطفى فأجبته . بدمع كوبل من فؤاد مقتل أراني أحب العرب والصحب جملة . وآلا وأنصارا لحب المزمل ولا سيما الشيخين ثم خليفة . يكنى أبا عمرو وصنو المبجل كذلك من حبيه حبي لطيبة . وأم القرى البطحا على كل منزل كذلك من حبيه حبي تلاوة . مقالي وحالي حب أفضل مرسل كذلك من حبيه حب مديحه . وأسمائه أسماء خير مؤمل وحبي لأهل الله أنصار دينه . وبغضي لمن عاداه في كل منهل فلست أحب الدهر شيئا سواءه . ولست أعادي غير أعداء موئلي لعلي أرى أعداء ديني تفرقوا . وصاروا جميعا تحت حجر مذلل وتخفق رايات الإله ودينه . بكف فتى يدعو لديني مهلل ألا يا رسول الله يا أفضل الورى . لتصلح شؤوني لم أجد عنك معدلي فإني جار شاعر الباب خادم . وإنك بحر الجود يا غوث مرمل فإن أبرق الأعداء يوما وأرعدوا . فإني جار المصطفى المتفضل وإن شبت النيران للحرب إنني . أرجيك أنا الدهر عنها بمعزل ومنك نرى في الحشر والفزع الذي . تشيب له الولدان أرفع منزل عليه صلاة الله ثم سلامه . وآل وصحب قد علوا كل أكمل',
            kaseydaT:
                'يُهَيِّجُ أَفْكَارِي لِمَدْحِ الْمُزَمِّلِ . غَرَامِي وَشَوْقِي لِلْجَمَالِ الْمُكَمِّلِ دَعَانِي جَمَالُ الْمُصْطَفَى فَأَجَبْتُهُ . بِدَمْعٍ كَوَبْلٍ مِنْ فُؤَادٍ مُقَتَّلِ أَرَانِي أُحِبُّ الْعُرْبَ وَالصَّحْبَ جُمْلَةً . وَآلًا وَأَنْصَارًا لِحُبِّ الْمُزَمِّلِ وَلَا سِيَمَا الشَّيْخَيْنِ ثُمَّ خَلِيفَةً . يُكَنَّى أَبَا عَمْرٍو وَصِنْوَ الْمُبَجَّلِ كَذَلِكَ مَنْ حُبِّيهِ حُبِّي لِطَيْبَةٍ . وَأُمِّ الْقُرَى الْبَطْحَا عَلَى كُلِّ مَنْزِلِ كَذَلِكَ مَنْ حُبِّيهِ حُبِّي تِلَاوَةً . مَقَالِي وَحَالِي حُبُّ أَفْضَلِ مُرْسَلِ كَذَلِكَ مَنْ حُبِّيهِ حُبُّ مَدِيحِهِ . وَأَسْمَائِهِ أَسْمَاءِ خَيْرِ مُؤَمَّلِ وَحُبِّي لِأَهْلِ اللهِ أَنْصَارِ دِينِهِ . وَبُغْضِي لِمَنْ عَادَاهُ فِي كُلِّ مَنْهَلِ فَلَسْتُ أُحِبُّ الدَّهْرَ شَيْئًا سِوَاءَهُ . وَلَسْتُ أُعَادِي غَيْرَ أَعْدَاءِ مَوْئِلِي لَعَلِّي أَرَى أَعْدَاءَ دِينِي تَفَرَّقُوا . وَصَارُوا جَمِيعًا تَحْتَ حِجْرٍ مُذَلَّلِ وَتَخْفِقُ رَايَاتُ الْإلَهِ وَدِينِهِ . بِكَفِّ فَتًى يَدْعُو لِدِينِي مُهَلِّلِ أَلَا يَا رَسُولَ اللهِ يَا أَفْضَلَ الْوَرَى . لِتُصْلِحْ شُؤُونِي لَمْ أَجِدْ عَنْكَ مَعْدَلِي فَإنِّيَ جَارٌ شَاعِرُ الْبَابِ خَادِمٌ . وَإنَّكَ بَحْرُ الْجُودِ يَا غَوْثَ مُرْمِلِ فَإنْ أَبْرَقَ الْأَعْدَاءُ يَوْمًا وَأَرْعَدُوا . فَإنِّيَ جَارُ الْمُصْطَفَى الْمُتَفَضِّلِ وَإنْ شَبَّتِ النِّيرَانُ لِلْحَرْبِ إنَّنِي . أُرَجِّيكَ أَنَّا الدَّهْرَ عَنْهَا بِمَعْزِلِ وَمِنْكَ نَرَى فِي الْحَشْرِ وَالْفَزَعِ الذِي . تَشِيبُ لَهُ الْوِلْدَانُ أَرْفَعَ مَنْزِلِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ قَدْ عَلَوْا كُلَّ أَكْمَلِ',
            letter: 'ل',
          ),
          KasydaBody(
            id: 'K24',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio24.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'حماية هذا العبد من كل حائم',
            nameT: 'حِمَايَةُ هَذَا الْعَبْدِ مِنْ كُلِّ حَائِمِ',
            kaseyda:
                'حماية هذا العبد من كل حائم . محبة خير الخلق مأوى الأكارم هو البحر والليث الجسور شجاعة . وجودا فخير الخلق بحر المكارم هو الشمس والغيث المريع هداية . وبذلا وبله الغيث غير مداوم فساس جميع العرب والعجم كلها . فعم هداه اليوم كل الأقالم وشتت شمل المشركين وقد علا . بسطوته التوحيد دون مزاحم إماما كريما منصفا ومقوما . أديبا مهيبا محسنا للمساخم جميلا جليلا منفقا متواضعا . ولم يك فظا لا وليس بظالم وقد كان منصورا برعب فصحبه . به دوخوا البلدان لا بالصوارم فيا ليته قوى العبيد وصحبه . لندرك ثأرا من عدو وغاشم ويعلي بنا التوحيد حقا بسرعة . ويغني ذوي الحاجات من كل رائم بجاه رسول الله ثم صحابه . فيعلو منار الدين فوق المعالم عليه صلاة الله ثم سلامه . لكي لا يعيش العبد عيش البهائم عليه صلاة الله ثم سلامه . فلي شهوة في ذكر تسليم هاشمي عليه صلاة الله ثم سلامه . فقد حير المختار أفكار عالم عليه صلاة الله ثم سلامه . فلي سكرة تفنى لديها عوالمي عليه صلاة الله ثم سلامه . به أرتقي للحب أقصى سلالم عليه صلاة الله ثم سلامه . مع الآل والصحب البحور الخضارم',
            kaseydaT:
                'حِمَايَةُ هَذَا الْعَبْدِ مِنْ كُلِّ حَائِمِ . مَحَبَّةُ خَيْرِ الْخَلْقِ مَأْوَى الْأَكَارِمِ هُوَ الْبَحْرُ وَالَّليْثُ الْجَسُورُ شَجَاعَةً . وَجُودًا فَخَيْرُ الْخَلْقِ بَحْرُ الْمَكَارِمِ هُوَ الشَّمْسُ وَالْغَيْثُ الْمَرِيعُ هِدَايَةً . وَبَذْلًا وَبَلْهَ الْغَيْثَ غَيْرَ مُدَاوِمِ فَسَاسُ جَمِيعِ الْعُرْبِ وَالْعُجْمِ كُلِّهَا . فَعَمَّ هُدَاهُ الْيَوْمَ كُلَّ الْأَقَالِمِ وَشَتَّتَ شَمْلَ الْمُشْرِكِينَ وَقَدْ عَلَا . بِسَطْوَتِهِ التَّوْحِيدَ دُونَ مُزَاحِمِ إمَامًا كَرِيمًا مُنْصِفًا وَمُقَوِّمًا . أَدِيبًا مَهِيبًا مُحْسِنًا لِلْمُسَاخِمِ14 جَمِيلًا جَلِيلًا مُنْفِقًا مُتَوَاضِعًا . وَلَمْ يَكُ فَظًّا لَا وَلَيْسَ بِظَالِمِ وَقَدْ كَانَ مَنْصُورًا بِرُعْبٍ فَصَحْبُهُ . بِهِ دَوَّخُوا الْبُلْدَانَ لَا بِالصَّوَارِمِ فَيَا لَيْتَهُ قَوَّى الْعُبَيْدَ وَصَحْبَهُ . لِنُدْرِكَ ثَأْرًا مِنْ عَدُوٍّ وَغَاشِمِ وَيُعْلِي بِنَا التَّوْحِيدَ حَقًّا بِسُرْعَةٍ . وَيُغْنِي ذَوِي الْحَاجَاتِ مِنْ كُلِّ رَائِمِ بِجَاهِ رَسُولِ اللهِ ثُمَّ صِحَابِهِ . فَيَعْلُو مَنَارُ الدِّينِ فَوْقَ الْمَعَالِمِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . لِكَيْ لَا يَعِيشَ الْعَبْدُ عَيْشَ الْبَهَائِمِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . فَلِي شَهْوَةٌ فِي ذِكْرِ تَسْلِيمِ هَاشِمِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . فَقَدْ حَيَّرَ الْمُخْتَارَ أَفْكَارُ عَالَمِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . فَلِي سَكْرَةٌ تَفْنَى لَدَيْهَا عَوَالِمِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . بِهِ أَرْتَقِي لِلْحُبِّ أَقْصَى سَلَالِمِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . مَعَ الْآلِ وَالصَّحْبِ الْبُحُورِ الْخَضَارِمِ',
            letter: 'م',
          ),
          KasydaBody(
            id: 'K25',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio25.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'زمان رسول الله خير زمان',
            nameT: 'زَمَانُ رَسُولِ اللهِ خَيْرُ زَمَانِ',
            kaseyda:
                'زمان رسول الله خير زمان . وطيبة خير الخلق خير مكان فمن لي بكأس من أريس15 ورومة16 . فشوقي إلى تلك البقاع دهاني فشوقي إلى وادي العقيق وسلعه . حماني منامي فالمنام جفاني وشوقي إلى وادي النقا وبقيعه17 . وللصخرة الملسا إليه دعاني فهل تسمح الأيام يوما بعودة . إليها فهاتي بغيتي وأماني وهل لي أن أكسو العتيق وتكتسي . كذا القبة الخضراء روض جنان وهل لي فلك ماخرات تقل من . يحج لبيت الله دون توان وتدني لهم أرض الحبيب قيادتي . وقد شدت بالبطحاء كل مبان عليه صلاة الله ثم سلامه . صلاة تزج العبد وسط جنان عليه صلاة الله ثم سلامه . تعجل فتحي والمنى والتهاني عليه صلاة الله ثم سلامه . تضيء جناني أو تضيء مغاني عليه صلاة الله ثم سلامه . تملكني تصريف كل معان عليه صلاة الله ثم سلامه . صلاة تنجينا بدون معان عليه مع الآل الكرام وصحبه . صلاة وتسليم مرور الزمان',
            kaseydaT:
                'زَمَانُ رَسُولِ اللهِ خَيْرُ زَمَانِ . وَطَيْبَةُ خَيْرِ الْخَلْقِ خَيْرُ مَكَانِ فَمَنْ لِي بِكَأْسٍ مِنْ أَرِيسٍ وَرُومَةٍ . فَشَوْقِي إلَى تِلْكَ الْبِقَاعِ دَهَانِي فَشَوْقِي إلَى وَادِي الْعَقِيقِ وَسَلْعِهِ . حَمَانِي مَنَامِي فَالْمَنَامُ جَفَانِي وَشَوْقِي إلَى وَادِي النَّقَا وَبَقِيعِهِ17 . وَلِلصَّخْرَةِ الْمَلْسَا إلَيْهِ دَعَانِي فَهَلْ تَسْمَحُ الْأَيَّامُ يَوْمًا بِعَوْدَةٍ . إلَيْهَا فَهَاتِي بُغْيَتِي وَأَمَانِي وَهَلْ لِيَ أَنْ أَكْسُو الْعَتِيقَ وَتَكْتَسِي . كَذَا الْقُبَّةُ الْخَضْرَاءُ رَوْضَ جِنَانِ وَهَلْ لِيَ فُلْكٌ مَاخِرَاتٌ تُقِلُّ مَنْ . يَحُجُّ لِبَيْتِ اللهِ دُونَ تَوَانِ وَتُدْنِي لَهُمْ أَرْضَ الْحَبِيبِ قِيَادَتِي . وَقَدْ شِدْتُ بِالْبَطْحَاءِ كُلَّ مَبَانِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةٌ تَزُجُّ الْعَبْدَ وَسْطَ جِنَانِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُعَجِّلُ فَتْحِي وَالْمُنَى وَالتَّهَانِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُضِيءُ جِنَانِي أَوْ تُضِيءُ مَغَانِي عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . تُمَلِّكُنِي تَصْرِيفَ كُلِّ مَعَانِ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً تُنَجِّينَا بِدُونِ مُعَانِ عَلَيْهِ مَعَ الْآلِ الْكِرَامِ وَصَحْبِهِ . صَلَاةٌ وَتَسْلِيمٌ مُرُورَ الزَّمَانِ',
            letter: 'ن',
          ),
          KasydaBody(
            id: 'K26',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio26.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'محا حب خير الخلق حب سواه',
            nameT: 'مَحَا حُبُّ خَيْرِ الْخَلْقِ حُبَّ سِوَاهُ',
            kaseyda:
                'محا حب خير الخلق حب سواه . بقلبي الذي أحياه سر سناه فلست أروم الوصل من غير حامد . فدع عنك محبوبا سواه وهاه فإن جمالا غير وجه محمد . نفاه جمال المصطفى ومحاه هو الحسن والنور المبين فمن نحا . لحضرته بالحب نال مناه هو الكل منه الكل حقا ولم أكن . أجسم معنى إذ قصدت ثناه فإياك والإعراض عن كل صورة . إذا رمت من سر الوجود لقاه فصل وصم واشرب وكل وانكحن وصل . فما ثم غير المصطفى وحلاه عليه صلاة الله ثم سلامه . صلاة بها ألفى لوسط حماه عليه صلاة الله ثم سلامه . صلاة بها أجني ثمار جناه عليه صلاة الله ثم سلامه . صلاة بها دهري أنال رضاه عليه صلاة الله ثم سلامه . أشم بها عرف اللقا وشذاه عليه صلاة الله ثم سلامه . وآل وصحب قد علوا بعلاه',
            kaseydaT:
                'مَحَا حُبُّ خَيْرِ الْخَلْقِ حُبَّ سِوَاهُ . بِقَلْبِي الذِي أَحْيَاهُ سِرُّ سَنَاهُ فَلَسْتُ أَرُومُ الْوَصْلَ مِنْ غَيْرِ حَامِدٍ . فَدَعْ عَنْكَ مَحْبُوبًا سِوَاهُ وَهَاهُ فَإنَّ جَمَالًا غَيْرَ وَجْهِ مُحَمَّدٍ . نَفَاهُ جَمَالُ الْمُصْطَفَى وَمَحَاهُ هُوَ الْحُسْنُ وَالنُّورُ الْمُبِينُ فَمَنْ نَحَا . لِحَضْرَتِهِ بِالْحُبِّ نَالَ مُنَاهُ هُوَ الْكُلُّ مِنْهُ الْكُلُّ حَقًّا وَلَمْ أَكُنْ . أُجَسِّمُ مَعْنًى إذْ قَصَدْتُ ثَنَاهُ فَإيَّاكَ وَالْإعْرَاضَ عَنْ كُلِّ صُورَةٍ . إذَا رُمْتَ مِنْ سِرِّ الْوُجُودِ لِقَاهُ فَصَلِّ وَصُمْ وَاشْرَبْ وَكُلْ وَانْكِحَنْ وَصِلْ . فَمَا ثَمَّ غَيْرُ الْمُصْطَفَى وَحُلَاهُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أُلْفَى لِوَسْطِ حِمَاهُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أَجْنِي ثِمَارَ جَنَاهُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا دَهْرِي أَنَالُ رِضَاهُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . أَشُمُّ بِهَا عَرْفَ اللِّقَا وَشَذَاهُ عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ قَدْ عَلَوْا بِعُلَاهُ',
            letter: 'ه',
          ),
          KasydaBody(
            id: 'K27',
            audio: [
              Audio(
                sheikhAr: 'الشيخ إبراهيم نياس',
                sheikhEn: 'Al-Sheikh Ibrahim Nias',
                url:
                    'https://firebasestorage.googleapis.com/v0/b/dwaween-8ede4.appspot.com/o/tone10.mp3?alt=media&token=fef27844-a2d9-499b-84f4-002dce1f01a6',
                id: 'audio27.mp3',
              ),
            ],
            purpose: 'المديح النبوي',
            type: 'Kasyda',
            name: 'قد امتلأت أرجاء قلبي ولا غروا',
            nameT: 'قَدِ امْتَلَأَتْ أَرْجَاءُ قَلْبِي وَلَا غَرْوَا',
            kaseyda:
                'قد امتلأت أرجاء قلبي ولا غروا . بحب أمين الله في السر والنجوى محمد عبد الله سيد خلقه . فلم أرفعن يوما إلى غيره شكوى له آية تبقى مدى الدهر بعدما . تلاشى سواها أين ذا المن والسلوى كتاب كريم من كريم منزل . عليك كريما من كرام علوا مثوى كتاب مجيد من مجيد ممجد . عليك مجيدا عند ذي العرش والمأوى كتاب جليل من جليل منزل . على قلب من يمحو الضلال مع الأهوا كتاب عظيم من عظيم منزل . على أعظم الأقوام من لبسه التقوى كتاب من الله الجليل جلاله . على المصطفى المختار من لا له شروى كتاب به شرع من العرش نازل . على خير مخلوق به ترفع البلوى عليك به حبلا من الله واثقا . ففيه نجاة من ضلال ومن إغوا فأشهد أن الله لا رب غيره . ومذ بلغ المختار وانزاحت الأسوا عليه صلاة الله ثم سلامه . صلاة بها كل العبادات قد تطوى عليه صلاة الله ثم سلامه . صلاة بها أرقى إلى الغاية القصوى عليه صلاة الله ثم سلامه . صلاة بها تمحى ذنوب الفتى محوا عليه صلاة الله ثم سلامه . وآل وصحب قد سقوا حبه صفوا',
            kaseydaT:
                'قَدِ امْتَلَأَتْ أَرْجَاءُ قَلْبِي وَلَا غَرْوَا . بِحُبِّ أَمِينِ اللهِ فِي السِّرِّ وَالنَّجْوَى مُحَمَّدُ عَبْدُ اللهِ سَيِّدُ خَلْقِهِ . فَلَمْ أَرْفَعَنْ يَوْمًا إلَى غَيْرِهِ شَكْوَى لَهُ آيَةٌ تَبْقَى مَدَى الدَّهْرِ بَعْدَمَا . تَلَاشَى سِوَاهَا أَيْنَ ذَا الْمَنُّ وَالسَّلْوَى كِتَابُ كَرِيمٍ مِنْ كَرِيمٍ مُنَزَّلٌ . عَلَيْكَ كَرِيمًا مِنْ كِرَامٍ عَلَوْا مَثْوَى كِتَابٌ مَجِيدٌ مِنْ مَجِيدٍ مُمَجَّدٍ . عَلَيْكَ مَجِيدًا عِنْدَ ذِي الْعَرْشِ وَالْمَأْوَى كِتَابٌ جَلِيلٌ مِنْ جَلِيلٍ مُنَزَّلٌ . عَلَى قَلْبِ مَنْ يَمْحُو الضَّلَالَ مَعَ الْأَهْوَا كِتَابٌ عَظِيمٌ مِنْ عَظِيمٍ مُنَزَّلٌ . عَلَى أَعْظَمِ الْأَقْوَامِ مَنْ لُبْسُهُ التَّقْوَى كِتَابٌ مِنَ اللهِ الْجَلِيلِ جَلَالُهُ . عَلَى الْمُصْطَفَى الْمُخْتَارِ مَنْ لَا لَهُ شَرْوَى كِتَابٌ بِهِ شَرْعٌ مِنَ الْعَرْشِ نَازِلٌ . عَلَى خَيْرِ مَخْلُوقٍ بِهِ تُرْفَعُ الْبَلْوَى عَلَيْكَ بِهِ حَبْلًا مِنَ اللهِ وَاثِقًا . فَفِيهِ نَجَاةٌ مِنْ ضَلَالٍ وَمِنْ إغْوَا فَأَشْهَدُ أَنَّ اللهَ لَا رَبَّ غَيْرُهُ . وَمُذْ بَلَغَ الْمُخْتَارُ وَانْزَاحَتِ الْأَسْوَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا كُلُّ الْعِبَادَاتِ قَدْ تُطْوَى عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا أَرْقَى إلَى الْغَايَةِ الْقُصْوَى عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . صَلَاةً بِهَا تُمْحَى ذُنُوبُ الْفَتَى مَحْوَا عَلَيْهِ صَلَاةُ اللهِ ثُمَّ سَلَامُهُ . وَآلٍ وَصَحْبٍ قَدْ سُقُوا حُبَّهُ صَفْوَا',
            letter: 'و',
          ),
        ],
      ),
    ],
  );

  uploadDataMethod() async {
    await FirebaseFirestore.instance
        .collection('dwaween')
        .doc('5CoLOJ5JvPGc25c9dHUU')
        .update(uploadData.toMap())
        .catchError((error) {
      // Handle any errors here
    });
  }

  //?============================GlobalData=================================================
  FirestoreService service = FirestoreService(FirebaseFirestore.instance);

  List<groupByPurpose> groupedBy = [];

  DawawenBody? dewanBody;

  bool dewanBodyLoading = true;

  Future<void> readDwaweenData() async {
    dewanBodyLoading = true;
    notifyListeners();

    final DocumentSnapshot snapshot = await FirebaseFirestore.instance
        .collection('dwaween')
        .doc('5CoLOJ5JvPGc25c9dHUU')
        .get();

    final loadedData = snapshot.data() as Map<String, dynamic>;

    dewanBody = DawawenBodyModel.fromJson(loadedData);
    HomeScreenData = dewanBody!.dawawen;
    DewanScreenData = dewanBody!.dawawen;
    KasayedScreenData = dewanBody!.dawawen;
    DewanDetailsScreenData = dewanBody!.dawawen;

    dewanBodyLoading = false;
    groupByPurposeMethod(dewanBody!.dawawen);
    notifyListeners();
  }

  void groupByPurposeMethod(List<Dawawen> dawawenList) {
    Map<String, List<KasydaBody>> grouped = {};

    for (var dawawen in dawawenList) {
      for (var kaseda in dawawen.kasaed) {
        grouped.putIfAbsent(kaseda.purpose, () => []);
        grouped[kaseda.purpose]!.add(kaseda);
      }
    }

    groupedBy = grouped.entries.map((entry) {
      return groupByPurpose(
        purpose: entry.key,
        kenshat: entry.value,
      );
    }).toList();

    notifyListeners();
  }

  //?============================BaseScreen=================================================
  final scaffoldKey = GlobalKey<ScaffoldState>();
  int selectedIndex = 0;

  List<Widget> screens = [
    HomeScreen(),
    DwaweenScreen(),
    KasaedScreen(),
    AboutScreen(),
  ];

  void setSelectedIndex({required int index}) {
    selectedIndex = index;
    notifyListeners();
  }

  //?============================HomeScreen=================================================
  TextEditingController homeController = TextEditingController();
  int? _dewanIndex;
  int _groupByPurposeIndex = 0;

  List<Dawawen> HomeScreenData = [];

  List<String> _kafya = [];

  int? get dewanIndex => _dewanIndex;

  List<String> get kafya => _kafya;

  int get groupByPurposeIndex => _groupByPurposeIndex;

  setDewanIndex(int? value) {
    _dewanIndex = value;
    notifyListeners();
  }

  setkafya(List<String> value) {
    _kafya = value;
    notifyListeners();
  }

  setGroupByPurposeIndex(int value) {
    _groupByPurposeIndex = value;
    notifyListeners();
  }

  searchHomeMethod({
    required String searchValue,
  }) {
    if (searchValue.isNotEmpty) {
      String lowerCaseSearchValue = (searchValue).toLowerCase();
      HomeScreenData =
          searchDewanBodyByNameAndKaseyda(lowerCaseSearchValue, dewanBody!);
      groupByPurposeMethod(HomeScreenData);
    } else {
      HomeScreenData = dewanBody!.dawawen;
      groupByPurposeMethod(dewanBody!.dawawen);
    }
    notifyListeners();
  }

  List<Dawawen> searchDewanBodyByNameAndKaseyda(
    String query,
    DawawenBody dewanBody,
  ) {
    return dewanBody.dawawen.where((dawawen) {
      return dawawen.name.contains(query) ||
          dawawen.kasaed.any((kasyda) => kasyda.name.contains(query));
    }).map((dawawen) {
      if (dawawen.name.contains(query)) {
        return Dawawen(
          id: dawawen.id,
          name: dawawen.name,
          nameT: dawawen.nameT,
          dec: dawawen.dec,
          type: dawawen.type,
          kasaed: dawawen.kasaed,
        );
      } else {
        return Dawawen(
          id: dawawen.id,
          name: dawawen.name,
          nameT: dawawen.nameT,
          dec: dawawen.dec,
          type: dawawen.type,
          kasaed: dawawen.kasaed
              .where((kasyda) => kasyda.name.contains(query))
              .toList(),
        );
      }
    }).toList();
  }

  calculateKafyaList(int index) {
    _kafya.clear();
    for (var element in dewanBody!.dawawen[index].kasaed) {
      if (!_kafya.contains(element.letter)) {
        _kafya.add(element.letter);
      }
    }
    notifyListeners();
  }

  //?============================DewanScreen=================================================
  TextEditingController dewanController = TextEditingController();
  List<Dawawen> DewanScreenData = [];

  searchDewanMethod({
    required String searchValue,
  }) {
    if (searchValue.isNotEmpty) {
      String lowerCaseSearchValue = (searchValue).toLowerCase();
      DewanScreenData = searchDewanBodyByName(lowerCaseSearchValue, dewanBody!);
      groupByPurposeMethod(DewanScreenData);
    } else {
      DewanScreenData = dewanBody!.dawawen;
      groupByPurposeMethod(dewanBody!.dawawen);
    }
    notifyListeners();
  }

  List<Dawawen> searchDewanBodyByName(String query, DawawenBody dewanBody) {
    return dewanBody.dawawen.where((dawawen) {
      return dawawen.name.contains(query);
    }).toList();
  }

  //?============================KasayedScreen=================================================

  TextEditingController kasayedController = TextEditingController();
  List<Dawawen> KasayedScreenData = [];

  searchKasayedMethod({
    required String searchValue,
  }) {
    if (searchValue.isNotEmpty) {
      String lowerCaseSearchValue = (searchValue).toLowerCase();

      KasayedScreenData =
          filterKaseydaByTextOrPurpose(lowerCaseSearchValue, dewanBody!);

      groupByPurposeMethod(KasayedScreenData);
    } else {
      KasayedScreenData = dewanBody!.dawawen;
      groupByPurposeMethod(dewanBody!.dawawen);
    }
    notifyListeners();
  }

  List<Dawawen> filterKaseydaByTextOrPurpose(
    String text,
    DawawenBody dewanBody,
  ) {
    List<Dawawen> filteredDawawen = [];

    dewanBody.dawawen.forEach((dawawen) {
      List<KasydaBody> matchingKasyda = dawawen.kasaed
          .where(
            (kenashat) =>
                (kenashat.kaseyda.toLowerCase().contains(text.toLowerCase())) ||
                kenashat.purpose.toLowerCase().contains(text.toLowerCase()),
          )
          .toList();
      if (matchingKasyda.isNotEmpty) {
        // Create a new copy of the Dawawen object with the matching KasydaBody objects
        Dawawen filteredDawawenCopy = Dawawen(
          id: dawawen.id,
          name: dawawen.name,
          nameT: dawawen.nameT,
          dec: dawawen.dec,
          type: dawawen.type,
          kasaed: matchingKasyda,
        );

        filteredDawawen.add(filteredDawawenCopy);
      }
    });
    return filteredDawawen;
  }

  //?============================AboutScreen=================================================
  TextEditingController aboutController = TextEditingController();

  void changeLang({required BuildContext context}) {
    if (context.locale.languageCode == 'ar') {
      EasyLocalization.of(context)!.setLocale(Locale('en'));
    } else {
      EasyLocalization.of(context)!.setLocale(Locale('ar'));
    }
    notifyListeners();
  }

  //?============================DewanDetailsScreen=================================================
  int? kafyaIndex;

  TextEditingController kafyaController = TextEditingController();
  List<Dawawen> DewanDetailsScreenData = [];
  List<KasydaBody> KasaedDetailsScreenData = [];

  setKafyaIndex(int? index) {
    kafyaIndex = index;

    notifyListeners();
  }

  // kafya[kafyaIndex ?? 0]
  // kafyaController.text.toLowerCase()
  filterByKasyda() {
    KasaedDetailsScreenData = filterKasydaBodies(
      DewanDetailsScreenData[dewanIndex!].kasaed,
      kaseyda: kafyaController.text.isEmpty
          ? null
          : kafyaController.text.toLowerCase(),
      letter: kafyaIndex == null ? null : kafya[kafyaIndex!],
    );

    notifyListeners();
  }

  List<KasydaBody> filterKasydaBodies(
    List<KasydaBody> kasydaBodies, {
    String? kaseyda,
    String? letter,
  }) {
    if (kaseyda == null && letter == null) {
      return kasydaBodies;
    }

    return kasydaBodies.where((kasydaBody) {
      if (kaseyda != null) {
        return kasydaBody.kaseyda.toLowerCase().contains(kaseyda.toLowerCase());
      }
      if (letter != null) {
        return kasydaBody.letter.contains(letter);
      }
      return false;
    }).toList();
  }

  //?============================KasydaDetailsScreen=================================================
  TextEditingController KasydaDetailsController = TextEditingController();
  ScreenshotController screenshotController = ScreenshotController();

  FirebaseStorage storage = FirebaseStorage.instance;

  KasydaBody? _KasydaDetailsBody;

  KasydaBody? get KasydaDetailsBody => _KasydaDetailsBody;

  Future<void> setKasydaDetailsBody(KasydaBody? value, String local) async {
    print('KasydaDetailsBody');
    print(value);
    _KasydaDetailsBody = value;
    _audioPlayer.setUrl(_KasydaDetailsBody!.audio.first.url);
    _sheikh = local == 'ar'
        ? _KasydaDetailsBody!.audio.first.sheikhAr
        : _KasydaDetailsBody!.audio.first.sheikhEn;

    notifyListeners();
  }

  List<String> K = [];
  List<String> KT = [];

  int _fontSize = 20;

  int get fontSize => _fontSize;

  increaseFontSize() {
    fontTransactionEffect = true;
    notifyListeners();

    if (_fontSize < 98) {
      _fontSize = _fontSize + 2;
      notifyListeners();
    }

    Future.delayed(Duration(milliseconds: 1500))
        .then((value) => fontTransactionEffect = false)
        .then((value) => notifyListeners());
  }

  decreaseFontSize() {
    fontTransactionEffect = true;
    notifyListeners();

    if (_fontSize > 12) {
      _fontSize = _fontSize - 2;
      notifyListeners();
    }

    Future.delayed(Duration(milliseconds: 1000))
        .then((value) => fontTransactionEffect = false)
        .then((value) => notifyListeners());
  }

  setFontSize(int value) {
    fontTransactionEffect = true;
    notifyListeners();

    _fontSize = value;
    notifyListeners();

    Future.delayed(Duration(milliseconds: 1000))
        .then((value) => fontTransactionEffect = false)
        .then((value) => notifyListeners());
  }

  bool fontTransactionEffect = false;

  List<Color> fontColors = [
    Colors.black,
    Color(0xff1AA386),
    Color(0xff0E264C),
    Color(0xff0E264C),
    Color(0xff51DECF),
  ];

  List<Color> BGColors = [
    Colors.white,
    Color(0xffFFF8E9),
    Color(0xffDFDFDF),
    Color(0xffE6DBD0),
    Color(0xffDBEDF1),
  ];

  int _fontColorIndex = 0;
  int _BGColorIndex = 1;

  int get fontColorIndex => _fontColorIndex;

  int get BGColorIndex => _BGColorIndex;

  setFontColor(int index) {
    _fontColorIndex = index;
    notifyListeners();
  }

  setBGColor(int index) {
    _BGColorIndex = index;
    notifyListeners();
  }

  List<String> versesToShareList = [];

  setVersesToShareList(String value) {
    if (versesToShareList.contains(value)) {
      versesToShareList.remove(value);
    } else {
      if (versesToShareList.length < 4) {
        versesToShareList.add(value);
      } else {
        Utils().displayToastMessage('limit_verses'.tr());
      }
    }

    notifyListeners();
  }

  int _shareDialogIndex = 0;

  int get shareDialogIndex => _shareDialogIndex;

  setShareDialogIndex(int value) {
    _shareDialogIndex = value;

    notifyListeners();
  }

  final CarouselController carouselController = CarouselController();

  int _carouselIndex = 0;

  int get carouselIndex => _carouselIndex;

  setCarouselIndex(int value) {
    _carouselIndex = value;

    notifyListeners();
  }

  ListResult? result;
  List<Future<String>> xurls = [];

  AudioPlayer _audioPlayer = AudioPlayer();

  AudioPlayer get audioPlayer => _audioPlayer;

  int _audioIndex = 0;
  int get audioIndex => _audioIndex;

  String _sheikh = '';

  String get sheikh => _sheikh;

  setVocalist({required int audioIndex, required String local}) {
    _audioIndex = audioIndex;
    _audioPlayer.dispose();
    setIsPlaying(false);

    _audioPlayer = AudioPlayer()
      ..setUrl(_KasydaDetailsBody!.audio[audioIndex].url);
    _audioPlayer.play();
    setIsPlaying(true);
    _sheikh = local == 'ar'
        ? _KasydaDetailsBody!.audio[audioIndex].sheikhAr
        : _KasydaDetailsBody!.audio[audioIndex].sheikhEn;

    notifyListeners();
  }

  int _loobMode = 0;

  int get loobMode => _loobMode;

  setLoobMode(int value) {
    _loobMode = value;
    notifyListeners();
  }

  bool _isPlaying = false;

  bool get isPlaying => _isPlaying;

  setIsPlaying(bool value) {
    _isPlaying = value;
    notifyListeners();
  }

  shareText(BuildContext context) async {
    final box = context.findRenderObject() as RenderBox;
    await Share.share(
      versesToShareList.join('\n'),
      subject: KasydaDetailsBody?.name ?? '',
      sharePositionOrigin: box.localToGlobal(Offset.zero) & box.size,
    );
  }

  void captureScreenShot(
    BuildContext context,
    String image,
    String text,
  ) async {
    final directory = await getTemporaryDirectory();
    Uint8List? imageBytes = await screenshotController.captureFromWidget(
      KasydaShareScreen(
        image: image,
        text: text,
      ),
    );
    String dateTime = DateTime.now().year.toString() +
        DateTime.now().month.toString() +
        DateTime.now().day.toString() +
        DateTime.now().hour.toString() +
        DateTime.now().minute.toString() +
        DateTime.now().second.toString();
    String filePath = '${directory.path}/screenshot$dateTime.png';
    await File(filePath).writeAsBytes(imageBytes);
    // File tempFile = File(filePath);
    await Share.shareXFiles([XFile(filePath)], text: '', subject: '');
    // saveImageToGallery(context,imageBytes);
  }

  splitKasyda() {
    K = KasydaDetailsBody!.kaseyda.toString().split('.');
    KT = KasydaDetailsBody!.kaseydaT.toString().split('.');
    notifyListeners();
  }

  Future<void> downloadFile() async {
    try {} catch (e) {
      throw e;
    }

    notifyListeners();
  }

  //?============================KasayedByCategoryScreen=================================================

  TextEditingController kasayedByGategoryController = TextEditingController();

  searchKasayedByGategoryMethod({
    required String? searchValue,
  }) {
    // restJson();
    String lowerCaseSearchValue = (searchValue ?? '').toLowerCase();
    if (lowerCaseSearchValue.isNotEmpty) {
      groupedBy[groupByPurposeIndex]
          .kenshat
          .where(
            (element) =>
                element.purpose.toLowerCase().contains(lowerCaseSearchValue),
          )
          .toList();
    } else {
      groupedBy[groupByPurposeIndex].kenshat;
    }
    notifyListeners();
  }

//!----------------------------------------------------------------------------
  bool _cardDataLoading = true;

  bool get cardDataLoading => _cardDataLoading;
  AudioPlayer _cardAudioPlayer = AudioPlayer();

  AudioPlayer get cardAudioPlayer => _cardAudioPlayer;

  bool _cardIsPlaying = false;

  bool get cardIsPlaying => _cardIsPlaying;

  CardData? _cardData;

  CardData? get cardData => _cardData;

  void playCardAudio() {
    _cardAudioPlayer.play();
    _cardIsPlaying = true;
    notifyListeners();
  }

  void pauseCardAudio() {
    _cardAudioPlayer.pause();
    _cardIsPlaying = false;
    notifyListeners();
  }

  Future<void> readCardData() async {
    _cardDataLoading = true;
    notifyListeners();

    final DocumentSnapshot snapshot = await FirebaseFirestore.instance
        .collection('dwaween')
        .doc('kibIWBlgZ3ML7YeziVnH')
        .get();

    final loadedData = snapshot.data() as Map<String, dynamic>;

    _cardData = CardDataModel.fromJson(loadedData['homeCard']);

    _cardAudioPlayer = AudioPlayer()..setUrl(_cardData!.url);

    _cardDataLoading = false;
    notifyListeners();
  }

  //?============================FavoriteScreen=================================================
  TextEditingController favoriteController = TextEditingController();

  List<KasydaBody> favoriteListData = [];

  Future<void> readDataFromDataBase() async {
    favoriteListData = await DatabaseHelperFav().getAllKasydaBodies();
    print(favoriteListData.length);
    notifyListeners();
  }

  deleteDataFromDataBase({required String id}) async {
    await DatabaseHelperFav().deleteKasydaBody(id).whenComplete(() async {
      favoriteListData = await DatabaseHelperFav().getAllKasydaBodies();
    });
    notifyListeners();
  }

  saveDataToDataBase({required KasydaBody kasydaBody}) async {
    if (await DatabaseHelperFav().containsKasydaBody(kasydaBody.id)) {
      Utils().displayToastMessage('kasyda_already_added'.tr());
    } else {
      await DatabaseHelperFav()
          .saveKasydaBody(kasydaBody)
          .whenComplete(() async {
        favoriteListData = await DatabaseHelperFav().getAllKasydaBodies();
      });

      Utils().displayToastMessage('kasyda_added_successfully'.tr());
    }

    notifyListeners();
  }

//?============================Notes Screen=================================================
  TextEditingController noteController = TextEditingController();
  TextEditingController titleNoteController = TextEditingController();
  TextEditingController contentNoteController = TextEditingController();

  List<NoteBody> notesListData = [];

  Future<void> readNotesDataFromDataBase() async {
    notesListData = await DatabaseHelperNotes().getAllNotesBodies();
    print(notesListData.length);
    notifyListeners();
  }

  deleteNotesDataFromDataBase({required String id}) async {
    await DatabaseHelperNotes().deleteNoteBody(id).whenComplete(() async {
      notesListData = await DatabaseHelperNotes().getAllNotesBodies();
    });
    notifyListeners();
  }

  saveNotesDataToDataBase({required NoteBody noteBody}) async {
    if (await DatabaseHelperNotes().containsNoteBody(noteBody.title)) {
      Utils().displayToastMessage('notes_already_added'.tr());
    } else {
      await DatabaseHelperNotes().saveNoteBody(noteBody).whenComplete(() async {
        notesListData = await DatabaseHelperNotes().getAllNotesBodies();
      });

      Utils().displayToastMessage('notes_added_successfully'.tr());
    }

    notifyListeners();
  }

  //?============================ContactUsScreen=================================================
  TextEditingController messageController = TextEditingController();

  //?============================AboutUsScreen=================================================
  TextEditingController aboutUsController = TextEditingController();
}
